gdgly/AC_Charger/apollo/metal/nxp/ametal_easy_arm_lpc177x_8x/ametal/lpc177x_8x/drivers/include/lpc177x_8x_pin.h
/*******************************************************************************
*                                 Apollo
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2015 Guangzhou ZHIYUAN Electronics Stock Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
* e-mail:      apollo.support@zlg.cn
*******************************************************************************/

/**
 * \file
 * \brief LPC17xx GPIO 引脚配置参数定义
 * 
 * \internal
 * \par Modification History
 * - 1.00 15-04-24  tee, first implementation.
 * \endinternal
 */

#ifndef __LPC177X_8X_PIN_H
#define __LPC177X_8X_PIN_H

#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus  */

#include "amdr_gpio_util.h"

/** 
 * \addtogroup amhw_if_pin
 * \copydoc lpc177x_8x_pin.h
 * @{
 */     

/**
 * \name LPC17xx 引脚编号定义
 * @{
 */


#define PIO0_0       0           /**< \brief 引脚 PIO0_0 */
#define PIO0_1       1           /**< \brief 引脚 PIO0_1 */
#define PIO0_2       2           /**< \brief 引脚 PIO0_2 */
#define PIO0_3       3           /**< \brief 引脚 PIO0_3 */
#define PIO0_4       4           /**< \brief 引脚 PIO0_4 */
#define PIO0_5       5           /**< \brief 引脚 PIO0_5 */
#define PIO0_6       6           /**< \brief 引脚 PIO0_10 */
#define PIO0_7       7           /**< \brief 引脚 PIO0_7 */
#define PIO0_8       8           /**< \brief 引脚 PIO0_8 */
#define PIO0_9       9           /**< \brief 引脚 PIO0_9 */
#define PIO0_10      10          /**< \brief 引脚 PIO0_10 */
#define PIO0_11      11          /**< \brief 引脚 PIO0_11 */
#define PIO0_12      12          /**< \brief 引脚 PIO0_12 */
#define PIO0_13      13          /**< \brief 引脚 PIO0_13 */
#define PIO0_14      14          /**< \brief 引脚 PIO0_14 */
#define PIO0_15      15          /**< \brief 引脚 PIO0_15 */
#define PIO0_16      16          /**< \brief 引脚 PIO0_16 */
#define PIO0_17      17          /**< \brief 引脚 PIO0_17 */
#define PIO0_18      18          /**< \brief 引脚 PIO0_18 */
#define PIO0_19      19          /**< \brief 引脚 PIO0_19 */
#define PIO0_20      20          /**< \brief 引脚 PIO0_20 */
#define PIO0_21      21          /**< \brief 引脚 PIO0_21 */
#define PIO0_22      22          /**< \brief 引脚 PIO0_22 */
#define PIO0_23      23          /**< \brief 引脚 PIO0_23 */
#define PIO0_24      24          /**< \brief 引脚 PIO0_24 */
#define PIO0_25      25          /**< \brief 引脚 PIO0_25 */
#define PIO0_26      26          /**< \brief 引脚 PIO0_26 */
#define PIO0_27      27          /**< \brief 引脚 PIO0_27 */
#define PIO0_28      28          /**< \brief 引脚 PIO0_28 */
#define PIO0_29      29          /**< \brief 引脚 PIO0_29 */
#define PIO0_30      30          /**< \brief 引脚 PIO0_30 */
#define PIO0_31      31          /**< \brief 引脚 PIO0_31 */

#define PIO1_0       32          /**< \brief 引脚 PIO1_0 */
#define PIO1_1       33          /**< \brief 引脚 PIO1_1 */
#define PIO1_2       34          /**< \brief 引脚 PIO1_2 */
#define PIO1_3       35          /**< \brief 引脚 PIO1_3 */
#define PIO1_4       36          /**< \brief 引脚 PIO1_4 */
#define PIO1_5       37          /**< \brief 引脚 PIO1_5 */
#define PIO1_6       38          /**< \brief 引脚 PIO1_6 */
#define PIO1_7       39          /**< \brief 引脚 PIO1_7 */
#define PIO1_8       40          /**< \brief 引脚 PIO1_8 */
#define PIO1_9       41          /**< \brief 引脚 PIO1_9 */
#define PIO1_10      42          /**< \brief 引脚 PIO1_10 */
#define PIO1_11      43          /**< \brief 引脚 PIO1_11 */
#define PIO1_12      44          /**< \brief 引脚 PIO1_12 */
#define PIO1_13      45          /**< \brief 引脚 PIO1_13 */
#define PIO1_14      46          /**< \brief 引脚 PIO1_14 */
#define PIO1_15      47          /**< \brief 引脚 PIO1_15 */
#define PIO1_16      48          /**< \brief 引脚 PIO1_16 */
#define PIO1_17      49          /**< \brief 引脚 PIO1_17 */
#define PIO1_18      50          /**< \brief 引脚 PIO1_18 */
#define PIO1_19      51          /**< \brief 引脚 PIO1_19 */
#define PIO1_20      52          /**< \brief 引脚 PIO1_20 */
#define PIO1_21      53          /**< \brief 引脚 PIO1_21 */
#define PIO1_22      54          /**< \brief 引脚 PIO1_22 */
#define PIO1_23      55          /**< \brief 引脚 PIO1_23 */
#define PIO1_24      56          /**< \brief 引脚 PIO1_24 */
#define PIO1_25      57          /**< \brief 引脚 PIO1_25 */
#define PIO1_26      58          /**< \brief 引脚 PIO1_26 */
#define PIO1_27      59          /**< \brief 引脚 PIO1_27 */
#define PIO1_28      60          /**< \brief 引脚 PIO1_28 */
#define PIO1_29      61          /**< \brief 引脚 PIO1_29 */
#define PIO1_30      62          /**< \brief 引脚 PIO1_30 */
#define PIO1_31      63          /**< \brief 引脚 PIO1_31 */

#define PIO2_0       64          /**< \brief 引脚 PIO2_0 */
#define PIO2_1       65          /**< \brief 引脚 PIO2_1 */
#define PIO2_2       66          /**< \brief 引脚 PIO2_2 */
#define PIO2_3       67          /**< \brief 引脚 PIO2_3 */
#define PIO2_4       68          /**< \brief 引脚 PIO2_4 */
#define PIO2_5       69          /**< \brief 引脚 PIO2_5 */
#define PIO2_6       70          /**< \brief 引脚 PIO2_6 */
#define PIO2_7       71          /**< \brief 引脚 PIO2_7 */
#define PIO2_8       72          /**< \brief 引脚 PIO2_8 */
#define PIO2_9       73          /**< \brief 引脚 PIO2_9 */
#define PIO2_10      74          /**< \brief 引脚 PIO2_10 */
#define PIO2_11      75          /**< \brief 引脚 PIO2_11 */
#define PIO2_12      76          /**< \brief 引脚 PIO2_12 */
#define PIO2_13      77          /**< \brief 引脚 PIO2_13 */
#define PIO2_14      78          /**< \brief 引脚 PIO2_14 */
#define PIO2_15      79          /**< \brief 引脚 PIO2_15 */
#define PIO2_16      80          /**< \brief 引脚 PIO2_16 */
#define PIO2_17      81          /**< \brief 引脚 PIO2_17 */
#define PIO2_18      82          /**< \brief 引脚 PIO2_18 */
#define PIO2_19      83          /**< \brief 引脚 PIO2_19 */
#define PIO2_20      84          /**< \brief 引脚 PIO2_20 */
#define PIO2_21      85          /**< \brief 引脚 PIO2_21 */
#define PIO2_22      86          /**< \brief 引脚 PIO2_22 */
#define PIO2_23      87          /**< \brief 引脚 PIO2_23 */
#define PIO2_24      88          /**< \brief 引脚 PIO2_24 */
#define PIO2_25      89          /**< \brief 引脚 PIO2_25 */
#define PIO2_26      90          /**< \brief 引脚 PIO2_26 */
#define PIO2_27      91          /**< \brief 引脚 PIO2_27 */
#define PIO2_28      92          /**< \brief 引脚 PIO2_28 */
#define PIO2_29      93          /**< \brief 引脚 PIO2_29 */
#define PIO2_30      94          /**< \brief 引脚 PIO2_30 */
#define PIO2_31      95          /**< \brief 引脚 PIO2_31 */

#define PIO3_0       96          /**< \brief 引脚 PIO3_0 */
#define PIO3_1       97          /**< \brief 引脚 PIO3_1 */
#define PIO3_2       98          /**< \brief 引脚 PIO3_2 */
#define PIO3_3       99          /**< \brief 引脚 PIO3_3 */
#define PIO3_4       100         /**< \brief 引脚 PIO3_4 */
#define PIO3_5       101         /**< \brief 引脚 PIO3_5 */
#define PIO3_6       102         /**< \brief 引脚 PIO3_6 */
#define PIO3_7       103         /**< \brief 引脚 PIO3_7 */
#define PIO3_8       104         /**< \brief 引脚 PIO3_8 */
#define PIO3_9       105         /**< \brief 引脚 PIO3_9 */
#define PIO3_10      106         /**< \brief 引脚 PIO3_10 */
#define PIO3_11      107         /**< \brief 引脚 PIO3_11 */
#define PIO3_12      108         /**< \brief 引脚 PIO3_12 */
#define PIO3_13      109         /**< \brief 引脚 PIO3_13 */
#define PIO3_14      110         /**< \brief 引脚 PIO3_14 */
#define PIO3_15      111         /**< \brief 引脚 PIO3_15 */
#define PIO3_16      112         /**< \brief 引脚 PIO3_16 */
#define PIO3_17      113         /**< \brief 引脚 PIO3_17 */
#define PIO3_18      114         /**< \brief 引脚 PIO3_18 */
#define PIO3_19      115         /**< \brief 引脚 PIO3_19 */
#define PIO3_20      116         /**< \brief 引脚 PIO3_20 */
#define PIO3_21      117         /**< \brief 引脚 PIO3_21 */
#define PIO3_22      118         /**< \brief 引脚 PIO3_22 */
#define PIO3_23      119         /**< \brief 引脚 PIO3_23 */
#define PIO3_24      120         /**< \brief 引脚 PIO3_24 */
#define PIO3_25      121         /**< \brief 引脚 PIO3_25 */
#define PIO3_26      122         /**< \brief 引脚 PIO3_26 */
#define PIO3_27      123         /**< \brief 引脚 PIO3_27 */
#define PIO3_28      124         /**< \brief 引脚 PIO3_28 */
#define PIO3_29      125         /**< \brief 引脚 PIO3_29 */
#define PIO3_30      126         /**< \brief 引脚 PIO3_30 */
#define PIO3_31      127         /**< \brief 引脚 PIO3_31 */

#define PIO4_0       128         /**< \brief 引脚 PIO4_0 */
#define PIO4_1       129         /**< \brief 引脚 PIO4_1 */
#define PIO4_2       130         /**< \brief 引脚 PIO4_2 */
#define PIO4_3       131         /**< \brief 引脚 PIO4_3 */
#define PIO4_4       132         /**< \brief 引脚 PIO4_4 */
#define PIO4_5       133         /**< \brief 引脚 PIO4_5 */
#define PIO4_6       134         /**< \brief 引脚 PIO4_6 */
#define PIO4_7       135         /**< \brief 引脚 PIO4_7 */
#define PIO4_8       136         /**< \brief 引脚 PIO4_8 */
#define PIO4_9       137         /**< \brief 引脚 PIO4_9 */
#define PIO4_10      138         /**< \brief 引脚 PIO4_10 */
#define PIO4_11      139         /**< \brief 引脚 PIO4_11 */
#define PIO4_12      140         /**< \brief 引脚 PIO4_12 */
#define PIO4_13      141         /**< \brief 引脚 PIO4_13 */
#define PIO4_14      142         /**< \brief 引脚 PIO4_14 */
#define PIO4_15      143         /**< \brief 引脚 PIO4_15 */
#define PIO4_16      144         /**< \brief 引脚 PIO4_16 */
#define PIO4_17      145         /**< \brief 引脚 PIO4_17 */
#define PIO4_18      146         /**< \brief 引脚 PIO4_18 */
#define PIO4_19      147         /**< \brief 引脚 PIO4_19 */
#define PIO4_20      148         /**< \brief 引脚 PIO4_20 */
#define PIO4_21      149         /**< \brief 引脚 PIO4_21 */
#define PIO4_22      150         /**< \brief 引脚 PIO4_22 */
#define PIO4_23      151         /**< \brief 引脚 PIO4_23 */
#define PIO4_24      152         /**< \brief 引脚 PIO4_24 */
#define PIO4_25      153         /**< \brief 引脚 PIO4_25 */
#define PIO4_26      154         /**< \brief 引脚 PIO4_26 */
#define PIO4_27      155         /**< \brief 引脚 PIO4_27 */
#define PIO4_28      156         /**< \brief 引脚 PIO4_28 */
#define PIO4_29      157         /**< \brief 引脚 PIO4_29 */
#define PIO4_30      158         /**< \brief 引脚 PIO4_30 */
#define PIO4_31      159         /**< \brief 引脚 PIO4_31 */

