gdgly/AC_Charger/apollo/metal/nxp/ametal_easy_arm_lpc177x_8x/ametal/lpc177x_8x/drivers/include/lpc177x_8x_pin.h
#define PIO5_0       160         /**< \brief 引脚 PIO5_0 */
#define PIO5_1       161         /**< \brief 引脚 PIO5_1 */
#define PIO5_2       162         /**< \brief 引脚 PIO5_2 */
#define PIO5_3       163         /**< \brief 引脚 PIO5_3 */
#define PIO5_4       164         /**< \brief 引脚 PIO5_4 */


#define AMDR_GPIO_PIN_MAX    PIO5_4
#define AMDR_GPIO_PIN_COUNT  (AMDR_GPIO_PIN_MAX + 1)

/** @} */

/**
 * \name GPIO 功能模式
 * @{
 */
 
/** \brief 无效（无上拉/下拉） */
#define AMDR_GPIO_FLOAT        AMDR_GPIO_MODE_CODE(0x0)

/** \brief 下拉模式 */
#define AMDR_GPIO_PULLDOWN     AMDR_GPIO_MODE_CODE(0x1)

/** \brief 上拉模式 */
#define AMDR_GPIO_PULLUP       AMDR_GPIO_MODE_CODE(0x2)

/** \brief 中继模式 */
#define AMDR_GPIO_REPEATER     AMDR_GPIO_MODE_CODE(0x3)

/** @} */


/**
 * \name PIO0_0 引脚功能定义
 * @{
 */
#define PIO0_0_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_0_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_0_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_0_RD1          AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief RD1 */
#define PIO0_0_TXD3         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief TXD3 */
#define PIO0_0_SDA1         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief SDA1 */
#define PIO0_0_TXD0         AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief TXD0 */
/** @} */

/**
 * \name PIO0_0 引脚模式定义
 * @{
 */
#define PIO0_0_PULLUP       AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_0_REPEATER     AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_0_FLOAT        AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_0_PULLDOWN     AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO0_0 迟滞模式使能定义
 * @{
 */
#define PIO0_0_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_0_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_0 输入反向控制使能定义
 * @{
 */
#define PIO0_0_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_0_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_0 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_0_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_0_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO0_0 开漏使能定义
 * @{
 */
#define PIO0_0_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_0_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_1 引脚功能定义
 * @{
 */
#define PIO0_1_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_1_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_1_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_1_TD1          AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief TD1 */
#define PIO0_1_RXD3         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief RXD3 */
#define PIO0_1_SCL1         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief SCL1 */
#define PIO0_1_RXD0         AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief RXD0 */
/** @} */

/**
 * \name PIO0_1 引脚模式定义
 * @{
 */
#define PIO0_1_PULLUP       AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_1_REPEATER     AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_1_FLOAT        AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_1_PULLDOWN     AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO0_1 迟滞模式使能定义
 * @{
 */
#define PIO0_1_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_1_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_1 输入反向控制使能定义
 * @{
 */
#define PIO0_1_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_1_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_1 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_1_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_1_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO0_1 开漏使能定义
 * @{
 */
#define PIO0_1_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_1_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_2 引脚功能定义
 * @{
 */
#define PIO0_2_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_2_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_2_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_2_TXD0         AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief TXD0 */
#define PIO0_2_TXD3         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief TXD3 */
/** @} */

/**
 * \name PIO0_2 引脚模式定义
 * @{
 */
#define PIO0_2_PULLUP       AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_2_REPEATER     AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_2_FLOAT        AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_2_PULLDOWN     AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO0_2 迟滞模式使能定义
 * @{
 */
#define PIO0_2_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_2_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_2 输入反向控制使能定义
 * @{
 */
#define PIO0_2_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_2_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_2 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_2_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_2_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO0_2 开漏使能定义
 * @{
 */
#define PIO0_2_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_2_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_3 引脚功能定义
 * @{
 */
#define PIO0_3_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_3_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_3_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_3_RXD0         AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief RXD0 */
#define PIO0_2_RXD3         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief RXD3 */
/** @} */

/**
 * \name PIO0_3 引脚模式定义
 * @{
 */
#define PIO0_3_PULLUP       AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_3_REPEATER     AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_3_FLOAT        AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_3_PULLDOWN     AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO0_3 迟滞模式使能定义
 * @{
 */
#define PIO0_3_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_3_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_3 输入反向控制使能定义
 * @{
 */
#define PIO0_3_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_3_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_3 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_3_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_3_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO0_3 开漏使能定义
 * @{
 */
#define PIO0_3_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_3_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_4 引脚功能定义
 * @{
 */
#define PIO0_4_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_4_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_4_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_4_I2SRX_CLK    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief I2SRX_CLK */
#define PIO0_4_RD2          AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief RD2 */
#define PIO0_4_CAP2_0       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief CAP2.0 */
#define PIO0_4_LCD_VD0      AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD_VD[0] */

/** @} */

/**
 * \name PIO0_4 引脚模式定义
 * @{
 */
#define PIO0_4_PULLUP       AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_4_REPEATER     AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_4_FLOAT        AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_4_PULLDOWN     AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO0_4 迟滞模式使能定义
 * @{
 */
#define PIO0_4_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_4_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_4 输入反向控制使能定义
 * @{
 */
#define PIO0_4_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_4_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_4 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_4_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_4_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO0_4 开漏使能定义
 * @{
 */
#define PIO0_4_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_4_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_5 引脚功能定义
 * @{
 */
#define PIO0_5_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_5_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_5_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_5_I2SRX_WS     AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief I2SRX_WS */
#define PIO0_5_TD2          AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief TD2 */
#define PIO0_5_CAP2_1       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief CAP2.1 */
#define PIO0_5_LCD_VD1      AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD_VD[1] */
/** @} */

/**
 * \name PIO0_5 引脚模式定义
 * @{
 */
#define PIO0_5_PULLUP       AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_5_REPEATER     AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_5_FLOAT        AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_5_PULLDOWN     AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO0_5 迟滞模式使能定义
 * @{
 */
#define PIO0_5_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_5_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_5 输入反向控制使能定义
 * @{
 */
#define PIO0_5_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_5_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_5 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_5_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_5_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO0_5 开漏使能定义
 * @{
 */
#define PIO0_5_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_5_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_6 引脚功能定义
 * @{
 */
#define PIO0_6_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_6_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_6_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_6_I2SRX_SDA    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief I2SRX_SDA */
#define PIO0_6_SSEL1        AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SSEL1 */
#define PIO0_6_MAT2_0       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT2.0 */
#define PIO0_6_RTS1         AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief U1_RTS */
#define PIO0_6_LCD_VD8      AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD_VD[8] */

/** @} */

/**
 * \name PIO0_6 引脚模式定义
 * @{
 */
#define PIO0_6_PULLUP       AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_6_REPEATER     AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_6_FLOAT        AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_6_PULLDOWN     AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_6 迟滞模式使能定义
 * @{
 */
#define PIO0_6_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_6_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_6 输入反向控制使能定义
 * @{
 */
#define PIO0_6_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_6_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_6 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_6_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_6_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO0_6 开漏使能定义
 * @{
 */
#define PIO0_6_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_6_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_7 引脚功能定义
 * @{
 */
#define PIO0_7_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_7_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_7_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_7_I2STX_CLK    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief I2STX_CLK */
#define PIO0_7_SCK1         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SCK1 */
#define PIO0_7_MAT2_1       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT2_1 */
#define PIO0_7_RTC_EV0      AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief RTC_EV0 */
#define PIO0_7_LCD_VD9      AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD_VD[9] */

/** @} */

/**
 * \name PIO0_7 引脚模式定义
 * @{
 */
#define PIO0_7_PULLUP       AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_7_REPEATER     AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_7_FLOAT        AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_7_PULLDOWN     AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_7 迟滞模式使能定义
 * @{
 */
#define PIO0_7_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_7_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_7 输入反向控制使能定义
 * @{
 */
#define PIO0_7_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_7_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_7 控制毛刺滤波器使能定义
 * @{
 */

