gdgly/AC_Charger/apollo/metal/nxp/ametal_easy_arm_lpc177x_8x/ametal/lpc177x_8x/drivers/include/lpc177x_8x_pin.h
/** \brief 不进行输入过滤（过滤失能）  */
#define PIO0_7_FILTER_DISABLE   AMDR_GPIO_FILTERENBIT_DISABLE
/** \brief 低于约10ns的噪音被过滤（默认）                 */
#define PIO0_7_FILTER_ENABLE    AMDR_GPIO_FILTERENBIT_ENABLE
/** @} */


/**
 * \name PIO0_7 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_7_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_7_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO0_7 开漏使能定义
 * @{
 */
#define PIO0_7_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_7_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_8 引脚功能定义
 * @{
 */
#define PIO0_8_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_8_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_8_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_8_I2STX_WS     AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief I2STX_WS */
#define PIO0_8_MISO1        AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief MISO1 */
#define PIO0_8_MAT2_2       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT2.2 */
#define PIO0_8_RTC_EV1      AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief RTC_EV1 */
#define PIO0_8_LCD_VD16     AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD_VD[16] */

/** @} */

/**
 * \name PIO0_8 引脚模式定义
 * @{
 */
#define PIO0_8_PULLUP       AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_8_REPEATER     AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_8_FLOAT        AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_8_PULLDOWN     AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_8 迟滞模式使能定义
 * @{
 */
#define PIO0_8_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_8_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_8 输入反向控制使能定义
 * @{
 */
#define PIO0_8_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_8_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_8 控制毛刺滤波器使能定义
 * @{
 */

/** \brief 不进行输入过滤（过滤失能）  */
#define PIO0_8_FILTER_DISABLE   AMDR_GPIO_FILTERENBIT_DISABLE
/** \brief 低于约10ns的噪音被过滤（默认）                 */
#define PIO0_8_FILTER_ENABLE    AMDR_GPIO_FILTERENBIT_ENABLE
/** @} */


/**
 * \name PIO0_8 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_8_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_8_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO0_8 开漏使能定义
 * @{
 */
#define PIO0_8_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_8_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_9 引脚功能定义
 * @{
 */
#define PIO0_9_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_9_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_9_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_9_I2STX_SDA    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief I2STX_SDA */
#define PIO0_9_MOSI1        AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief MOSI1 */
#define PIO0_9_MAT2_3       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT2.3 */
#define PIO0_9_RTC_EV2      AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief RTC_EV1 */
#define PIO0_9_LCD_VD17     AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD_VD[17] */

/** @} */

/**
 * \name PIO0_9 引脚模式定义
 * @{
 */
#define PIO0_9_PULLUP       AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_9_REPEATER     AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_9_FLOAT        AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_9_PULLDOWN     AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_9 迟滞模式使能定义
 * @{
 */
#define PIO0_9_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_9_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_9 输入反向控制使能定义
 * @{
 */
#define PIO0_9_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_9_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_9 控制毛刺滤波器使能定义
 * @{
 */

/** \brief 不进行输入过滤（过滤失能）  */
#define PIO0_9_FILTER_DISABLE   AMDR_GPIO_FILTERENBIT_DISABLE
/** \brief 低于约10ns的噪音被过滤（默认）                 */
#define PIO0_9_FILTER_ENABLE    AMDR_GPIO_FILTERENBIT_ENABLE
/** @} */


/**
 * \name PIO0_9 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_9_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_9_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO0_9 开漏使能定义
 * @{
 */
#define PIO0_9_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_9_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_10 引脚功能定义
 * @{
 */
#define PIO0_10_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_10_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_10_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_10_TXD2        AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief TXD2 */
#define PIO0_10_SDA2        AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SDA2 */
#define PIO0_10_MAT3_0      AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT3.0 */
/** @} */

/**
 * \name PIO0_10 引脚模式定义
 * @{
 */
#define PIO0_10_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_10_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_10_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_10_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_10 迟滞模式使能定义
 * @{
 */
#define PIO0_10_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_10_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_10 输入反向控制使能定义
 * @{
 */
#define PIO0_10_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_10_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_10 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_10_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_10_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */




/**
 * \name PIO0_10 开漏使能定义
 * @{
 */
#define PIO0_10_OD_DISABLE  AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_10_OD_ENABLE   AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_11 引脚功能定义
 * @{
 */
#define PIO0_11_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_11_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_11_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_11_RXD2        AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief RXD2 */
#define PIO0_11_SCL2        AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SCL2 */
#define PIO0_11_MAT3_1      AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT3.1 */
/** @} */

/**
 * \name PIO0_11 引脚模式定义
 * @{
 */
#define PIO0_11_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_11_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_11_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_11_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_11 迟滞模式使能定义
 * @{
 */
#define PIO0_11_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_11_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_11 输入反向控制使能定义
 * @{
 */
#define PIO0_11_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_11_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_11 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_11_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_11_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */




/**
 * \name PIO0_11 开漏使能定义
 * @{
 */
#define PIO0_11_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_11_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/


/**
 * \name PIO0_12 引脚功能定义
 * @{
 */
#define PIO0_12_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_12_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_12_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_12_USB2_PPWR   AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB2_PPWR */
#define PIO0_12_MISO1       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief MISO1 */
#define PIO0_12_AD0_6       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief AD0.6 */
/** @} */

/**
 * \name PIO0_12 引脚模式定义
 * @{
 */
#define PIO0_12_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_12_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_12_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_12_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO0_12 输入反向控制使能定义
 * @{
 */
#define PIO0_12_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_12_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_12 模拟/数字模式选择定义
 * @{
 */
#define PIO0_12_ADMODE_ANALOG   AMDR_GPIO_ADMODEENBIT_ANALOG    /**< \brief 模拟模式               */
#define PIO0_12_ADMODE_DIGITAL  AMDR_GPIO_ADMODEENBIT_DIGITAL   /**< \brief 数字模式 (默认)*/
/** @} */

/**
 * \name PIO0_12 控制毛刺滤波器使能定义
 * @{
 */

