gdgly/AC_Charger/apollo/metal/nxp/ametal_easy_arm_lpc177x_8x/ametal/lpc177x_8x/drivers/include/lpc177x_8x_pin.h
/** \brief 不进行输入过滤（过滤失能）  */
#define PIO0_12_FILTER_DISABLE   AMDR_GPIO_FILTERENBIT_DISABLE
/** \brief 低于约10ns的噪音被过滤（默认）                 */
#define PIO0_12_FILTER_ENABLE    AMDR_GPIO_FILTERENBIT_ENABLE
/** @} */

/**
 * \name PIO0_12 开漏使能定义
 * @{
 */
#define PIO0_12_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_12_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_13 引脚功能定义
 * @{
 */
#define PIO0_13_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_13_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_13_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_13_USB2_UP_LED AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB2_UP_LED */
#define PIO0_13_MOSI1       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief MOSI1 */
#define PIO0_13_AD0_7       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief AD0.7*/
/** @} */

/**
 * \name PIO0_13 引脚模式定义
 * @{
 */
#define PIO0_13_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_13_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_13_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_13_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO0_13 输入反向控制使能定义
 * @{
 */
#define PIO0_13_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_13_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_13 模拟/数字模式选择定义
 * @{
 */
#define PIO0_13_ADMODE_ANALOG   AMDR_GPIO_ADMODEENBIT_ANALOG    /**< \brief 模拟模式               */
#define PIO0_13_ADMODE_DIGITAL  AMDR_GPIO_ADMODEENBIT_DIGITAL   /**< \brief 数字模式 (默认)*/
/** @} */

/**
 * \name PIO0_13 控制毛刺滤波器使能定义
 * @{
 */

/** \brief 不进行输入过滤（过滤失能）  */
#define PIO0_13_FILTER_DISABLE   AMDR_GPIO_FILTERENBIT_DISABLE
/** \brief 低于约10ns的噪音被过滤（默认）                 */
#define PIO0_13_FILTER_ENABLE    AMDR_GPIO_FILTERENBIT_ENABLE
/** @} */

/**
 * \name PIO0_13 开漏使能定义
 * @{
 */
#define PIO0_13_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_13_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_14 引脚功能定义
 * @{
 */
#define PIO0_14_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_14_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_14_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_14_USB2_HSTEN   AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB2 HSTEN */
#define PIO0_14_SSEL1        AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SSP1_SSEL */
#define PIO0_14_USB2_CONNECT AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief USB2_CONNECT */
/** @} */

/**
 * \name PIO0_14 引脚模式定义
 * @{
 */
#define PIO0_14_PULLUP       AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_14_REPEATER     AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_14_FLOAT        AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_14_PULLDOWN     AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO0_14 迟滞模式使能定义
 * @{
 */
#define PIO0_14_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_14_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_14 输入反向控制使能定义
 * @{
 */
#define PIO0_14_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_14_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_14 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_14_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_14_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO0_14 开漏使能定义
 * @{
*/
#define PIO0_14_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_14_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_15 引脚功能定义
 * @{
 */
#define PIO0_15_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_15_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_15_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_15_TXD1        AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief TXD1 */
#define PIO0_15_SCK0        AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SCK0 */
#define PIO0_15_SPIFI_IO2   AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief SPIFI_IO[2] */

/** @} */

/**
 * \name PIO0_15 引脚模式定义
 * @{
 */
#define PIO0_15_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_15_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_15_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_15_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_15 迟滞模式使能定义
 * @{
 */
#define PIO0_15_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_15_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_15 输入反向控制使能定义
 * @{
 */
#define PIO0_15_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_15_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_15 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_15_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_15_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO0_15 开漏使能定义
 * @{
 */
#define PIO0_15_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_15_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_16 引脚功能定义
 * @{
 */
#define PIO0_16_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_16_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_16_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_16_RXD1        AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief RXD1 */
#define PIO0_16_SSEL0       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SSEL0 */
#define PIO0_16_SPIFI_IO3   AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief SPIFI_IO[3] */
/** @} */

/**
 * \name PIO0_16 引脚模式定义
 * @{
 */
#define PIO0_16_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_16_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_16_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_16_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_16 迟滞模式使能定义
 * @{
 */
#define PIO0_16_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_16_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_16 输入反向控制使能定义
 * @{
 */
#define PIO0_16_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_16_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_16 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_16_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_16_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO0_16 开漏使能定义
 * @{
 */
#define PIO0_16_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_16_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_17 引脚功能定义
 * @{
 */
#define PIO0_17_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_17_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_17_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_17_CTS1        AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief CTS1 */
#define PIO0_17_MISO0       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief MISO0 */
#define PIO0_17_SPIFI_IO1   AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief SPIFI_IO[1] */
/** @} */

/**
 * \name PIO0_17 引脚模式定义
 * @{
 */
#define PIO0_17_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_17_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_17_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_17_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_17 迟滞模式使能定义
 * @{
 */
#define PIO0_17_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_17_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_17 输入反向控制使能定义
 * @{
 */
#define PIO0_17_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_17_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_17 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_17_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_17_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO0_17 开漏使能定义
 * @{
 */
#define PIO0_17_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_17_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_18 引脚功能定义
 * @{
 */
#define PIO0_18_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_18_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_18_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_18_DCD1        AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief DCD1  */
#define PIO0_18_MOSI0       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief MOSI0 */
#define PIO0_18_SPIFI_IO0   AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief SPIFI_IO[0] */
/** @} */

/**
 * \name PIO0_18 引脚模式定义
 * @{
 */
#define PIO0_18_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_18_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_18_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_18_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_18 迟滞模式使能定义
 * @{
 */
#define PIO0_18_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_18_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_18 输入反向控制使能定义
 * @{
 */
#define PIO0_18_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_18_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_18 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_18_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_18_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO0_18 开漏使能定义
 * @{
 */
#define PIO0_18_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_18_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_19 引脚功能定义
 * @{
 */
#define PIO0_19_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_19_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_19_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_19_DSR1        AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief DSR1 */
#define PIO0_19_SD_CLK      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SD_CLK */
#define PIO0_19_SDA1        AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief SDA1 */
/** @} */

/**
 * \name PIO0_19 引脚模式定义
 * @{
 */
#define PIO0_19_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_19_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_19_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_19_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_19 迟滞模式使能定义
 * @{
 */
#define PIO0_19_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_19_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_19 输入反向控制使能定义
 * @{
 */
#define PIO0_19_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_19_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_19 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_19_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_19_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO0_19 开漏使能定义
 * @{
 */
#define PIO0_19_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_19_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_20 引脚功能定义
 * @{
 */
#define PIO0_20_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_20_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_20_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_20_DTR1        AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief DTR1 */
#define PIO0_20_SD_CMD      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SD_CMD */
#define PIO0_20_SCL1        AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief SCL1 */

/** @} */

/**
 * \name PIO0_20 引脚模式定义
 * @{
 */
#define PIO0_20_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_20_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_20_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_20_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_20 迟滞模式使能定义
 * @{
 */
#define PIO0_20_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_20_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_20 输入反向控制使能定义
 * @{
 */
#define PIO0_20_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_20_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_20 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_20_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_20_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO0_20 开漏使能定义
 * @{
 */
#define PIO0_20_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_20_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_21 引脚功能定义
 * @{
 */
#define PIO0_21_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_21_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_21_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_21_RI1         AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief RI1 */
#define PIO0_21_SD_PWR      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SD_PWR */
#define PIO0_21_OE4         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief UART4_OE */
#define PIO0_21_RD1         AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief RD1 */
#define PIO0_21_SCLK4       AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief SCLK4 */
/** @} */

/**
 * \name PIO0_21 引脚模式定义
 * @{
 */
#define PIO0_21_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_21_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_21_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_21_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_21 迟滞模式使能定义
 * @{
 */
#define PIO0_21_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_21_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_21 输入反向控制使能定义
 * @{
 */
#define PIO0_21_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_21_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_21 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_21_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_21_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO0_21 开漏使能定义
 * @{
 */
#define PIO0_21_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_21_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_22 引脚功能定义
 * @{
 */
#define PIO0_22_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_22_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_22_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_22_RTS1        AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief RTS1 */
#define PIO0_22_SD_DAT0     AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SD DAT[0] */
#define PIO0_22_TXD4        AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief UART4 TXD */
#define PIO0_22_TD1         AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief CAN1 TD */
#define PIO0_22_SPIFI_CLK   AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief SPIFI CLK */
/** @} */

/**
 * \name PIO0_22 引脚模式定义
 * @{
 */
#define PIO0_22_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_22_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_22_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_22_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_22 迟滞模式使能定义
 * @{
 */
#define PIO0_22_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO0_22_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO0_22 输入反向控制使能定义
 * @{
 */
#define PIO0_22_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_22_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_22 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO0_22_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO0_22_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO0_22 开漏使能定义
 * @{
 */
#define PIO0_22_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_22_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_23 引脚功能定义
 * @{
 */
#define PIO0_23_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_23_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO0_23_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_23_AD0_0       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief AD0.0       */
#define PIO0_23_I2SRX_CLK   AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief I2SRX_CLK   */
#define PIO0_23_CAP3_0      AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief CAP3.0      */
/** @} */

/**
 * \name PIO0_23 引脚模式定义
 * @{
 */
#define PIO0_23_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_23_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_23_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_23_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_23 输入反向控制使能定义
 * @{
 */
#define PIO0_23_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_23_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_23 模拟/数字模式选择定义
 * @{
 */
#define PIO0_23_ADMODE_ANALOG   AMDR_GPIO_ADMODEENBIT_ANALOG    /**< \brief 模拟模式               */
#define PIO0_23_ADMODE_DIGITAL  AMDR_GPIO_ADMODEENBIT_DIGITAL   /**< \brief 数字模式 (默认)*/
/** @} */

/**
 * \name PIO0_23 控制毛刺滤波器使能定义
 * @{
 */

