gdgly/AC_Charger/apollo/metal/nxp/ametal_easy_arm_lpc177x_8x/ametal/lpc177x_8x/drivers/include/lpc177x_8x_pin.h
/** \brief 不进行输入过滤（过滤失能）  */
#define PIO0_23_FILTER_DISABLE   AMDR_GPIO_FILTERENBIT_DISABLE
/** \brief 低于约10ns的噪音被过滤（默认）                 */
#define PIO0_23_FILTER_ENABLE    AMDR_GPIO_FILTERENBIT_ENABLE
/** @} */


/**
 * \name PIO0_23 开漏使能定义
 * @{
 */
#define PIO0_23_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_23_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_24 引脚功能定义
 * @{
 */
#define PIO0_24_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_24_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO0_24_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_24_AD0_1       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief AD0.1       */
#define PIO0_24_I2SRX_WS    AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief I2SRX_WS    */
#define PIO0_24_CAP3_1      AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief CAP3.1      */
/** @} */

/**
 * \name PIO0_24 引脚模式定义
 * @{
 */
#define PIO0_24_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_23_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_24_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_24_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_24 输入反向控制使能定义
 * @{
 */
#define PIO0_24_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_24_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_24 模拟/数字模式选择定义
 * @{
 */
#define PIO0_24_ADMODE_ANALOG   AMDR_GPIO_ADMODEENBIT_ANALOG    /**< \brief 模拟模式               */
#define PIO0_24_ADMODE_DIGITAL  AMDR_GPIO_ADMODEENBIT_DIGITAL   /**< \brief 数字模式 (默认)*/
/** @} */

/**
 * \name PIO0_24 控制毛刺滤波器使能定义
 * @{
 */

/** \brief 不进行输入过滤（过滤失能）  */
#define PIO0_24_FILTER_DISABLE   AMDR_GPIO_FILTERENBIT_DISABLE
/** \brief 低于约10ns的噪音被过滤（默认）                 */
#define PIO0_24_FILTER_ENABLE    AMDR_GPIO_FILTERENBIT_ENABLE
/** @} */


/**
 * \name PIO0_24 开漏使能定义
 * @{
 */
#define PIO0_24_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_24_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_25 引脚功能定义
 * @{
 */
#define PIO0_25_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_25_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_25_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_25_AD0_2       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief AD0.2     */
#define PIO0_25_I2SRX_SDA   AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief I2SRX_SDA */
#define PIO0_25_TXD3        AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief TXD3      */
/** @} */

/**
 * \name PIO0_25 引脚模式定义
 * @{
 */
#define PIO0_25_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_25_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_25_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_25_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_25 输入反向控制使能定义
 * @{
 */
#define PIO0_25_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_25_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_25 模拟/数字模式选择定义
 * @{
 */
#define PIO0_25_ADMODE_ANALOG   AMDR_GPIO_ADMODEENBIT_ANALOG    /**< \brief 模拟模式               */
#define PIO0_25_ADMODE_DIGITAL  AMDR_GPIO_ADMODEENBIT_DIGITAL   /**< \brief 数字模式 (默认)*/
/** @} */

/**
 * \name PIO0_25 控制毛刺滤波器使能定义
 * @{
 */

/** \brief 不进行输入过滤（过滤失能）  */
#define PIO0_25_FILTER_DISABLE   AMDR_GPIO_FILTERENBIT_DISABLE
/** \brief 低于约10ns的噪音被过滤（默认）                 */
#define PIO0_25_FILTER_ENABLE    AMDR_GPIO_FILTERENBIT_ENABLE
/** @} */


/**
 * \name PIO0_25 开漏使能定义
 * @{
 */
#define PIO0_25_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_25_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_26 引脚功能定义
 * @{
 */
#define PIO0_26_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_26_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_26_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_26_AD0_3       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief AD0.3 */
#define PIO0_26_AOUT        AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief AOUT  */
#define PIO0_26_RXD3        AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief RXD3 */
/** @} */

/**
 * \name PIO0_26 引脚模式定义
 * @{
 */
#define PIO0_26_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO0_26_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO0_26_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO0_26_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO0_26 输入反向控制使能定义
 * @{
 */
#define PIO0_26_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_26_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_26 模拟/数字模式选择定义
 * @{
 */
#define PIO0_26_ADMODE_ANALOG   AMDR_GPIO_ADMODEENBIT_ANALOG    /**< \brief 模拟模式               */
#define PIO0_26_ADMODE_DIGITAL  AMDR_GPIO_ADMODEENBIT_DIGITAL   /**< \brief 数字模式 (默认)*/
/** @} */

/**
 * \name PIO0_26 DAC使能定义
 * @{
 */
#define PIO0_26_DAC_DISABLE   AMDR_GPIO_DACENBIT_DISABLE    /**< \brief DAC禁能 (默认) */
#define PIO0_26_DAC_ENABLE    AMDR_GPIO_DACENBIT_ENABLE     /**< \brief DAC使能 */
/** @} */

/**
 * \name PIO0_26 控制毛刺滤波器使能定义
 * @{
 */

