gdgly/AC_Charger/apollo/metal/nxp/ametal_easy_arm_lpc177x_8x/ametal/lpc177x_8x/drivers/include/lpc177x_8x_pin.h
/** \brief 不进行输入过滤（过滤失能）  */
#define PIO0_26_FILTER_DISABLE   AMDR_GPIO_FILTERENBIT_DISABLE
/** \brief 低于约10ns的噪音被过滤（默认）                 */
#define PIO0_26_FILTER_ENABLE    AMDR_GPIO_FILTERENBIT_ENABLE
/** @} */


/**
 * \name PIO0_26 开漏使能定义
 * @{
 */
#define PIO0_26_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO0_26_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_27 引脚功能定义
 * @{
 */
#define PIO0_27_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_27_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_27_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_27_SDA0        AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief SDA0    */
#define PIO0_27_USB_SDA     AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief USB_SDA */

/** @} */

/**
 * \name PIO0_27 输入反向控制使能定义
 * @{
 */
#define PIO0_27_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_27_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_27 输入反向控制使能定义
 * @{
 */

/**< \brief I2C 50ns毛刺滤波器及转换速率设置失能     */
#define PIO0_27_HS_DISABLE   AMDR_GPIO_HSENBIT_DISABLE
/**< \brief I2C 50ns毛刺滤波器及转换速率设置使能 (默认)    */
#define PIO0_27_HS_ENABLE    AMDR_GPIO_HSENBIT_ENABLE
/** @} */


/******************************************************************************/

/**
 * \name PIO0_28 引脚功能定义
 * @{
 */
#define PIO0_28_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_28_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_28_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_28_SCL0         AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief SCL0 */
#define PIO0_28_USB_SCL      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief USB_SCL */

/** @} */

/**
 * \name PIO0_28 输入反向控制使能定义
 * @{
 */
#define PIO0_28_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO0_28_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO0_28 输入反向控制使能定义
 * @{
 */

/**< \brief I2C 50ns毛刺滤波器及转换速率设置失能     */
#define PIO0_28_HS_DISABLE   AMDR_GPIO_HSENBIT_DISABLE
/**< \brief I2C 50ns毛刺滤波器及转换速率设置使能 (默认)    */
#define PIO0_28_HS_ENABLE    AMDR_GPIO_HSENBIT_ENABLE
/** @} */

/******************************************************************************/

/**
 * \name PIO0_29 引脚功能定义
 * @{
 */
#define PIO0_29_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_29_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_29_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_29_USB1_D_P     AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB1 D+ */
#define PIO0_29_EINT0        AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief EINT0 */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_30 引脚功能定义
 * @{
 */
#define PIO0_30_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_30_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_30_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_30_USB1_D_N     AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB1 D-      */
#define PIO0_30_EINT1        AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief EIN1 */
/** @} */

/******************************************************************************/


/**
 * \name PIO0_31 引脚功能定义
 * @{
 */
#define PIO0_31_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO0_31_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO0_31_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO0_31_USB2_D_P     AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB2 D+      */

/** @} */

/******************************************************************************/

/**
 * \name PIO1_0 引脚功能定义
 * @{
 */
#define PIO1_0_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_0_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO1_0_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_0_ENET_TXD0    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_TXD0      */
#define PIO1_0_CAP3_1       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief CAP3_1      */
#define PIO1_0_SCK2         AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief SSP2 SCK    */
/** @} */

/**
 * \name PIO1_0 引脚模式定义
 * @{
 */
#define PIO1_0_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_0_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_0_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_0_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_0 迟滞模式使能定义
 * @{
 */
#define PIO1_0_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_0_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_0 输入反向控制使能定义
 * @{
 */
#define PIO1_0_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_0_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_0 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_0_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_0_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO1_0 开漏使能定义
 * @{
 */
#define PIO1_0_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_0_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_1 引脚功能定义
 * @{
 */
#define PIO1_1_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_1_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_1_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_1_ENET_TXD1    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_TXD1    */
#define PIO1_1_MAT3_3       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MATCH T3_CH3  */
#define PIO1_1_MOSI2        AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief SSP2 MOSI    */
/** @} */

/**
 * \name PIO1_1 引脚模式定义
 * @{
 */
#define PIO1_1_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_1_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_1_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_1_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_1 迟滞模式使能定义
 * @{
 */
#define PIO1_1_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_1_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_1 输入反向控制使能定义
 * @{
 */
#define PIO1_1_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_1_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_1 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_1_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_1_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO1_1 开漏使能定义
 * @{
 */
#define PIO1_1_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_1_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO1_2 引脚功能定义
 * @{
 */
#define PIO1_2_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_2_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_2_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_2_ENET_TXD2    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_TXD2    */
#define PIO1_2_SD_CLK       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SD CLK  */
#define PIO1_2_PWM0_1       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief PWM0_1    */
 /** @} */

/**
 * \name PIO1_2 引脚模式定义
 * @{
 */
#define PIO1_2_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_2_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_2_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_2_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO1_2 迟滞模式使能定义
 * @{
 */
#define PIO1_2_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_2_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_2 输入反向控制使能定义
 * @{
 */
#define PIO1_2_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_2_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_2 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_2_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_2_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO1_2 开漏使能定义
 * @{
 */
#define PIO1_2_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_2_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO1_3 引脚功能定义
 * @{
 */
#define PIO1_3_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_3_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_3_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_3_ENET_TXD3    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_TXD3    */
#define PIO1_3_SD_CMD       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SD CMD       */
#define PIO1_3_PWM0_2       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief PWM0_2       */
/** @} */

/**
 * \name PIO1_3 引脚模式定义
 * @{
 */
#define PIO1_3_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_3_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_3_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_3_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO1_3 迟滞模式使能定义
 * @{
 */
#define PIO1_3_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_3_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_3 输入反向控制使能定义
 * @{
 */
#define PIO1_3_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_3_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_3 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_3_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_3_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO1_3 开漏使能定义
 * @{
 */
#define PIO1_3_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_3_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_4 引脚功能定义
 * @{
 */
#define PIO1_4_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_4_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_4_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_4_ENET_TX_EN   AMDR_GPIO_FUNCBITS_CODE(0x01)   /**< \brief ENET_TX_EN    */
#define PIO1_4_MAT3_2       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MATCH T3_CH2  */
#define PIO1_4_MISO2        AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief SSP2 MISO    */
/** @} */

/**
 * \name PIO1_4 引脚模式定义
 * @{
 */
#define PIO1_4_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_4_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_4_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_4_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO1_4 迟滞模式使能定义
 * @{
 */
#define PIO1_4_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_4_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_4 输入反向控制使能定义
 * @{
 */
#define PIO1_4_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_4_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_4 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_4_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_4_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO1_4 开漏使能定义
 * @{
 */
#define PIO1_4_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_4_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_5 引脚功能定义
 * @{
 */
#define PIO1_5_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_5_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_5_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_5_ENET_TX_ER   AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_TX_ER    */
#define PIO1_5_SD_PWR       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SD PWR  */
#define PIO1_5_PWM0_3       AMDR_GPIO_FUNCBITS_CODE(0x03)   /**< \brief PWM0_3    */
/** @} */

/**
 * \name PIO1_5 引脚模式定义
 * @{
 */
#define PIO1_5_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_5_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_5_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_5_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO1_5 迟滞模式使能定义
 * @{
 */
#define PIO1_5_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_5_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_5 输入反向控制使能定义
 * @{
 */
#define PIO1_5_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_5_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_5 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_5_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_5_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO1_5 开漏使能定义
 * @{
 */
#define PIO1_5_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_5_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO1_6 引脚功能定义
 * @{
 */
#define PIO1_6_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_6_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_6_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_6_ENET_TX_CLK  AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_TX_ER    */
#define PIO1_6_SD_DAT0      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SD DAT[0]  */
#define PIO1_6_PWM0_4       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief PWM0_4    */
/** @} */

/**
 * \name PIO1_6 引脚模式定义
 * @{
 */
#define PIO1_6_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_6_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_6_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_6_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO1_6 迟滞模式使能定义
 * @{
 */
#define PIO1_6_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_6_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_6 输入反向控制使能定义
 * @{
 */
#define PIO1_6_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_6_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_6 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_6_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_6_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO1_6 开漏使能定义
 * @{
 */
#define PIO1_6_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_6_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO1_7 引脚功能定义
 * @{
 */
#define PIO1_7_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_7_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_7_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_7_ENET_COL     AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET COL    */
#define PIO1_7_SD_DAT1      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SD DAT[1]  */
#define PIO1_7_PWM0_5       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief PWM0_5    */
/** @} */

/**
 * \name PIO1_7 引脚模式定义
 * @{
 */
#define PIO1_7_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_7_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_7_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_7_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO1_7 迟滞模式使能定义
 * @{
 */
#define PIO1_7_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_7_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_7 输入反向控制使能定义
 * @{
 */
#define PIO1_7_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_7_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_7 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_7_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_7_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO1_7 开漏使能定义
 * @{
 */
#define PIO1_7_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_7_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */


/******************************************************************************/

/**
 * \name PIO1_8 引脚功能定义
 * @{
 */
#define PIO1_8_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_8_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_8_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_8_ENET_CRS     AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_CRS     */
#define PIO1_8_MAT3_1       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief T3 MAT1      */
#define PIO1_8_SSEL2        AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief SSP2 SSEL    */


/** @} */

/**
 * \name PIO1_8 引脚模式定义
 * @{
 */
#define PIO1_8_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_8_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_8_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_8_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_8 迟滞模式使能定义
 * @{
 */
#define PIO1_8_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_8_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_8 输入反向控制使能定义
 * @{
 */
#define PIO1_8_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_8_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_8 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_8_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_8_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_8 开漏使能定义
 * @{
 */
#define PIO1_8_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_8_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_9 引脚功能定义
 * @{
 */
#define PIO1_9_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_9_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_9_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_9_ENET_RXD0    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_RXD0     */
#define PIO1_9_MAT3_0       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief T3 MAT0     */


/** @} */

/**
 * \name PIO1_9 引脚模式定义
 * @{
 */
#define PIO1_9_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_9_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_9_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_9_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_9 迟滞模式使能定义
 * @{
 */
#define PIO1_9_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_9_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_9 输入反向控制使能定义
 * @{
 */
#define PIO1_9_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_9_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_9 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_9_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_9_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_9 开漏使能定义
 * @{
 */
#define PIO1_9_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_9_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

