gdgly/AC_Charger/apollo/metal/nxp/ametal_easy_arm_lpc177x_8x/ametal/lpc177x_8x/drivers/include/lpc177x_8x_pin.h
/**
 * \name PIO1_10 引脚功能定义
 * @{
 */
#define PIO1_10_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_10_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_10_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_10_ENET_RXD1    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_RXD1     */
#define PIO1_10_CAP3_0       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief T3 CAP0     */

/** @} */

/**
 * \name PIO1_10 引脚模式定义
 * @{
 */
#define PIO1_10_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_10_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_10_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_10_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_10 迟滞模式使能定义
 * @{
 */
#define PIO1_10_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_10_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_10 输入反向控制使能定义
 * @{
 */
#define PIO1_10_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_10_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_10 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_10_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_10_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_10 开漏使能定义
 * @{
 */
#define PIO1_10_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_10_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/


/**
 * \name PIO1_11 引脚功能定义
 * @{
 */
#define PIO1_11_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_11_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_11_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_11_ENET_RXD2    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_RXD2     */
#define PIO1_11_SD_DAT2      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SD DAT[2]     */
#define PIO1_11_PWM0_6       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief PWM0[6]       */
/** @} */

/**
 * \name PIO1_11 引脚模式定义
 * @{
 */
#define PIO1_11_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_11_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_11_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_11_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO1_11 迟滞模式使能定义
 * @{
 */
#define PIO1_11_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_11_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_11 输入反向控制使能定义
 * @{
 */
#define PIO1_11_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_11_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_11 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_11_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_11_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO1_11 开漏使能定义
 * @{
 */
#define PIO1_11_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_11_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */
/******************************************************************************/
/**
 * \name PIO1_12 引脚功能定义
 * @{
 */
#define PIO1_12_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_12_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_12_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_12_ENET_RXD3    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_RXD3     */
#define PIO1_12_SD_DAT3      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SD DAT[3]     */
#define PIO1_12_PCAP0_0      AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief PWM0 CAP0       */
/** @} */

/**
 * \name PIO1_12 引脚模式定义
 * @{
 */
#define PIO1_12_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_12_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_12_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_12_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO1_12 引脚模式定义
 * @{
 */
#define PIO1_12_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_12_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_12_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_12_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO1_12 迟滞模式使能定义
 * @{
 */
#define PIO1_12_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_12_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_12 输入反向控制使能定义
 * @{
 */
#define PIO1_12_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_12_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_12 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_12_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_12_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO1_12 开漏使能定义
 * @{
 */
#define PIO1_12_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_12_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO1_13 引脚功能定义
 * @{
 */
#define PIO1_13_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_13_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_13_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_13_ENET_RX_DV   AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_RX_DV     */
/** @} */

/**
 * \name PIO1_13 引脚模式定义
 * @{
 */
#define PIO1_13_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_13_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_13_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_13_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO1_13 引脚模式定义
 * @{
 */
#define PIO1_13_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_13_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_13_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_13_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO1_13 迟滞模式使能定义
 * @{
 */
#define PIO1_13_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_13_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_13 输入反向控制使能定义
 * @{
 */
#define PIO1_13_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_13_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_13 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_13_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_13_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO1_13 开漏使能定义
 * @{
 */
#define PIO1_13_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_13_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */


/******************************************************************************/

/**
 * \name PIO1_14 引脚功能定义
 * @{
 */
#define PIO1_14_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_14_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_14_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_14_ENET_RX_ER   AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_RX_ER   */
#define PIO1_14_CAP2_0       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief T2 CAP0   */


/** @} */

/**
 * \name PIO1_14 引脚模式定义
 * @{
 */
#define PIO1_14_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_14_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_14_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_14_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_14 迟滞模式使能定义
 * @{
 */
#define PIO1_14_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_14_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_14 输入反向控制使能定义
 * @{
 */
#define PIO1_14_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_14_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_14 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_14_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_14_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_14 开漏使能定义
 * @{
 */
#define PIO1_14_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_14_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_15 引脚功能定义
 * @{
 */
#define PIO1_15_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_15_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能  */
#define PIO1_15_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能  */
#define PIO1_15_ENET_REF_CLK AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_REF_CLK */
#define PIO1_15_SDA2         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief I2C2 SDA   */

/** @} */

/**
 * \name PIO1_15 引脚模式定义
 * @{
 */
#define PIO1_15_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_15_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_15_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_15_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_15 迟滞模式使能定义
 * @{
 */
#define PIO1_15_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_15_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_15 输入反向控制使能定义
 * @{
 */
#define PIO1_15_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_15_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_15 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_15_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_15_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_15 开漏使能定义
 * @{
 */
#define PIO1_15_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_15_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_16 引脚功能定义
 * @{
 */
#define PIO1_16_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_16_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能  */
#define PIO1_16_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能  */
#define PIO1_16_ENET_MDC     AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief ENET_MDC     */
#define PIO1_16_TX_MCLK      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief I2S TX MCLK  */

/** @} */

/**
 * \name PIO1_16 引脚模式定义
 * @{
 */
#define PIO1_16_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_16_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_16_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_16_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_16 迟滞模式使能定义
 * @{
 */
#define PIO1_16_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_16_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_16 输入反向控制使能定义
 * @{
 */
#define PIO1_16_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_16_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_16 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_16_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_16_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_16 开漏使能定义
 * @{
 */
#define PIO1_16_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_16_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_17 引脚功能定义
 * @{
 */
#define PIO1_17_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_17_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能  */
#define PIO1_17_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能  */
#define PIO1_17_ENET_MDIO    AMDR_GPIO_FUNCBITS_CODE(0x01)   /**< \brief ENET_MDIO     */
#define PIO1_17_RX_MCLK      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief I2S RX MCLK  */

/** @} */

/**
 * \name PIO1_17 引脚模式定义
 * @{
 */
#define PIO1_17_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_17_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_17_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_17_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_17 迟滞模式使能定义
 * @{
 */
#define PIO1_17_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_17_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_17 输入反向控制使能定义
 * @{
 */
#define PIO1_17_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_17_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_17 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_17_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_17_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_17 开漏使能定义
 * @{
 */
#define PIO1_17_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_17_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_18 引脚功能定义
 * @{
 */
#define PIO1_18_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_18_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能  */
#define PIO1_18_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能  */
#define PIO1_18_USB1_UP_LED  AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB1_UP_LED    */
#define PIO1_18_PWM1_1       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM1.1        */
#define PIO1_18_CAP1_0       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief CAP1.0        */
#define PIO1_18_MISO1        AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief SSP1 MISO     */

/** @} */

/**
 * \name PIO1_18 引脚模式定义
 * @{
 */
#define PIO1_18_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_18_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_18_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_18_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_18 迟滞模式使能定义
 * @{
 */
#define PIO1_18_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_18_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_18 输入反向控制使能定义
 * @{
 */
#define PIO1_18_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_18_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_18 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_18_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_18_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_18 开漏使能定义
 * @{
 */
#define PIO1_18_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_18_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_19 引脚功能定义
 * @{
 */
#define PIO1_19_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_19_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能  */
#define PIO1_19_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能  */
#define PIO1_19_USB1_TX_E    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB1 TX EN   */
#define PIO1_19_USB1_PPWR    AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief USB1_PPWR     */
#define PIO1_19_CAP1_1       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief CAP1.1       */
#define PIO1_19_MCOA0        AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief MCOA0        */
#define PIO1_19_SCK1         AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief SSP1 SCK     */
#define PIO1_19_OE2          AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief USART2 OE    */
/** @} */

/**
 * \name PIO1_19 引脚模式定义
 * @{
 */
#define PIO1_19_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_19_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_19_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_19_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_19 迟滞模式使能定义
 * @{
 */
#define PIO1_19_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_19_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_19 输入反向控制使能定义
 * @{
 */
#define PIO1_19_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_19_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_19 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_19_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_19_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_19 开漏使能定义
 * @{
 */
#define PIO1_19_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_19_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_20 引脚功能定义
 * @{
 */
#define PIO1_20_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_20_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO1_20_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_20_USB1_TX_DP  AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB1 TX DP */
#define PIO1_20_PWM1_2      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM1.2 */
#define PIO1_20_PHA         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief QEI PHA    */
#define PIO1_20_MCI0       AMDR_GPIO_FUNCBITS_CODE(0x04)     /**< \brief MCPWM0 FEED OUTPUT  */
#define PIO1_20_SCK0        AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief SSP0 SCK   */
#define PIO1_20_LCD_VD6     AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[6]  */
#define PIO1_20_LCD_VD10    AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[10] */
/** @} */

/**
 * \name PIO1_20 引脚模式定义
 * @{
 */
#define PIO1_20_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_20_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_20_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_20_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_20 迟滞模式使能定义
 * @{
 */
#define PIO1_20_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_20_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_20 输入反向控制使能定义
 * @{
 */
#define PIO1_20_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_20_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_20 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_20_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_20_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_20 开漏使能定义
 * @{
 */
#define PIO1_20_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_20_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_21 引脚功能定义
 * @{
 */
#define PIO1_21_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_21_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO1_21_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_21_USB1_TX_DM  AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB1_TX_DM */
#define PIO1_21_PWM1_3      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM1.3 */
#define PIO1_21_SSEL0       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief SSEL0 */
#define PIO1_21_MCABORT     AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief MCABORT */
#define PIO1_21_LCD_VD7     AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[7]  */
#define PIO1_21_LCD_VD11    AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[11] */
/** @} */

/**
 * \name PIO1_21 引脚模式定义
 * @{
 */
#define PIO1_21_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_21_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_21_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_21_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_21 迟滞模式使能定义
 * @{
 */
#define PIO1_21_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_21_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

