gdgly/AC_Charger/apollo/metal/nxp/ametal_easy_arm_lpc177x_8x/ametal/lpc177x_8x/drivers/include/lpc177x_8x_pin.h
/**
 * \name PIO1_21 输入反向控制使能定义
 * @{
 */
#define PIO1_21_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_21_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_21 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_21_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_21_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_21 开漏使能定义
 * @{
 */
#define PIO1_21_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_21_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_22 引脚功能定义
 * @{
 */
#define PIO1_22_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_22_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO1_22_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_22_USB1_RCV    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB1 RCV    */
#define PIO1_22_USB1_PWRD   AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief USB1 PWR */
#define PIO1_22_MAT1_0      AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT1.0   */
#define PIO1_22_MCOB0       AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief MCOB0       */
#define PIO1_22_MOSI1       AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief SSP1 MOSI   */
#define PIO1_22_LCD_VD8     AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[8]  */
#define PIO1_22_LCD_VD12    AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[12] */
/** @} */

/**
 * \name PIO1_22 引脚模式定义
 * @{
 */
#define PIO1_22_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_22_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_22_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_22_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_22 迟滞模式使能定义
 * @{
 */
#define PIO1_22_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_22_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_22 输入反向控制使能定义
 * @{
 */
#define PIO1_22_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_22_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_22 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_22_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_22_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_22 开漏使能定义
 * @{
 */
#define PIO1_22_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_22_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_23 引脚功能定义
 * @{
 */
#define PIO1_23_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_23_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO1_23_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_23_USB1_RX_DP  AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB1 RX_DP    */
#define PIO1_23_PWM1_4      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM1.4 */
#define PIO1_23_PHB         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief QEI PHB */
#define PIO1_23_MCI1       AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief MCPWM01 FEED OUTPUT  */
#define PIO1_23_MISO0       AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief MISO0      */
#define PIO1_23_LCD_VD9     AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[9]  */
#define PIO1_23_LCD_VD13    AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[13] */
/** @} */

/**
 * \name PIO1_23 引脚模式定义
 * @{
 */
#define PIO1_23_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_23_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_23_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_23_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_23 迟滞模式使能定义
 * @{
 */
#define PIO1_23_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_23_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_23 输入反向控制使能定义
 * @{
 */
#define PIO1_23_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_23_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_23 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_23_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_23_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_23 开漏使能定义
 * @{
 */
#define PIO1_23_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_23_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_24 引脚功能定义
 * @{
 */
#define PIO1_24_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_24_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO1_24_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_24_USB1_RX_DM  AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB1 RX DM */
#define PIO1_24_PWM1_5      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM1.5 */
#define PIO1_24_IDX         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief QEI IDX    */
#define PIO1_24_MCI2       AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief MCPWM FB2  */
#define PIO1_24_MOSI0       AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief MOSI0  */
#define PIO1_23_LCD_VD10_14 AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[10]/VD[14] */
#define PIO1_23_LCD_VD14_10 AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[14]/VD[10] */

/** @} */

/**
 * \name PIO1_24 引脚模式定义
 * @{
 */
#define PIO1_24_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_24_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_24_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_24_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_24 迟滞模式使能定义
 * @{
 */
#define PIO1_24_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_24_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_24 输入反向控制使能定义
 * @{
 */
#define PIO1_24_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_24_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_24 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_24_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_24_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_24 开漏使能定义
 * @{
 */
#define PIO1_24_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_24_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_25 引脚功能定义
 * @{
 */
#define PIO1_25_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_25_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO1_25_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_25_USB1_LS     AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB1_LS    */
#define PIO1_25_USB1_HSTEN  AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief USB1_HSTEN    */
#define PIO1_25_MAT1_1      AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT1.1   */
#define PIO1_25_MCOA1       AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief MCOA1    */
#define PIO1_25_CLKOUT      AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief CLKOUT    */
#define PIO1_25_LCD_VD11    AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[11]  */
#define PIO1_25_LCD_VD15    AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[15] */
/** @} */

/**
 * \name PIO1_25 引脚模式定义
 * @{
 */
#define PIO1_25_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_25_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_25_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_25_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_25 迟滞模式使能定义
 * @{
 */
#define PIO1_25_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_25_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_25 输入反向控制使能定义
 * @{
 */
#define PIO1_25_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_25_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_25 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_25_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_25_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_25 开漏使能定义
 * @{
 */
#define PIO1_25_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_25_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_26 引脚功能定义
 * @{
 */
#define PIO1_26_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_26_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO1_26_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_26_USB1_SSPND  AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB SSPND */
#define PIO1_26_PWM1_6      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM1.6    */
#define PIO1_26_CAP0_0      AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief CAP0.0    */
#define PIO1_26_MCOB1       AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief MCOB1     */
#define PIO1_26_SSEL1       AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief SSP1 SSEL */
#define PIO1_26_LCD_VD12    AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[12]*/
#define PIO1_26_LCD_VD20    AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[20]*/
/** @} */

/**
 * \name PIO1_26 引脚模式定义
 * @{
 */
#define PIO1_26_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_26_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_26_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_26_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_26 迟滞模式使能定义
 * @{
 */
#define PIO1_26_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_26_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_26 输入反向控制使能定义
 * @{
 */
#define PIO1_26_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_26_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_26 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_26_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_26_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_26 开漏使能定义
 * @{
 */
#define PIO1_26_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_26_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_27 引脚功能定义
 * @{
 */
#define PIO1_27_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_27_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO1_27_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_27_USB1_INT    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB1 INT    */
#define PIO1_27_USB1_OVRCR  AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief USB_OVRCR   */
#define PIO1_27_CAP0_1      AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief CAP0.1      */
#define PIO1_27_CLKOUT      AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief CLKOUT      */
#define PIO1_27_LCD_VD13    AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[13]*/
#define PIO1_27_LCD_VD21    AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[21]*/
/** @} */

/**
 * \name PIO1_27 引脚模式定义
 * @{
 */
#define PIO1_27_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_27_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_27_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_27_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_27 迟滞模式使能定义
 * @{
 */
#define PIO1_27_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_27_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_27 输入反向控制使能定义
 * @{
 */
#define PIO1_27_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_27_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_27 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_27_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_27_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_27 开漏使能定义
 * @{
 */
#define PIO1_27_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_27_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_28 引脚功能定义
 * @{
 */
#define PIO1_28_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_28_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO1_28_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_28_USB1_SCL    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB SCL1    */
#define PIO1_28_PCAP1_0     AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PCAP1.0     */
#define PIO1_28_MAT0_0      AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT0.0      */
#define PIO1_28_MCOA2       AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief MCPWM 通道2输出A  */
#define PIO1_28_SSEL0       AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief SSP1 SSEL */
#define PIO1_28_LCD_VD14    AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[14]*/
#define PIO1_28_LCD_VD22    AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[22]*/
/** @} */

/**
 * \name PIO1_28 引脚模式定义
 * @{
 */
#define PIO1_28_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_28_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_28_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_28_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_28 迟滞模式使能定义
 * @{
 */
#define PIO1_28_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_28_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_28 输入反向控制使能定义
 * @{
 */
#define PIO1_28_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_28_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_28 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_28_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_28_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO1_28 开漏使能定义
 * @{
 */
#define PIO1_28_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_28_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_29 引脚功能定义
 * @{
 */
#define PIO1_29_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_29_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO1_29_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_29_USB1_SDA    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB1 SDA    */
#define PIO1_29_PCAP1_1     AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PCAP1.1     */
#define PIO1_29_MAT0_1      AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT0.1      */
#define PIO1_29_MCOB2       AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief MCOB2       */
#define PIO1_29_TXD4        AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief USART4 TXD  */
#define PIO1_29_LCD_VD15    AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[15]  */
#define PIO1_29_LCD_VD23    AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[23]  */
/** @} */

/**
 * \name PIO1_29 引脚模式定义
 * @{
 */
#define PIO1_29_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_29_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_29_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_29_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_29 迟滞模式使能定义
 * @{
 */
#define PIO1_29_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO1_29_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO1_29 输入反向控制使能定义
 * @{
 */
#define PIO1_29_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_29_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_29 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO1_29_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO1_29_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO1_29 开漏使能定义
 * @{
 */
#define PIO1_29_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_29_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_30 引脚功能定义
 * @{
 */
#define PIO1_30_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_30_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_30_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_30_USB2_PWRD   AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB2 PWRD   */
#define PIO1_30_VBUS        AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief VBUS        */
#define PIO1_30_AD0_4       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief AD0.4       */
#define PIO1_30_SDA0        AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief I2C0 SDA    */
#define PIO1_30_OE3         AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief UART3 OE    */
/** @} */

/**
 * \name PIO1_30 引脚模式定义
 * @{
 */
#define PIO1_30_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_30_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_30_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_30_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_30 输入反向控制使能定义
 * @{
 */
#define PIO1_30_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_30_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_30 模拟/数字模式选择定义
 * @{
 */
#define PIO1_30_ADMODE_ANALOG   AMDR_GPIO_ADMODEENBIT_ANALOG    /**< \brief 模拟模式               */
#define PIO1_30_ADMODE_DIGITAL  AMDR_GPIO_ADMODEENBIT_DIGITAL   /**< \brief 数字模式 (默认)*/
/** @} */

/**
 * \name PIO1_30 控制毛刺滤波器使能定义
 * @{
 */

