gdgly/AC_Charger/apollo/metal/nxp/ametal_easy_arm_lpc177x_8x/ametal/lpc177x_8x/drivers/include/lpc177x_8x_pin.h
/** \brief 不进行输入过滤（过滤失能）  */
#define PIO1_30_FILTER_DISABLE   AMDR_GPIO_FILTERENBIT_DISABLE
/** \brief 低于约10ns的噪音被过滤（默认）                 */
#define PIO1_30_FILTER_ENABLE    AMDR_GPIO_FILTERENBIT_ENABLE
/** @} */

/**
 * \name PIO1_30 开漏使能定义
 * @{
 */
#define PIO1_30_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_30_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_31 引脚功能定义
 * @{
 */
#define PIO1_31_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO1_31_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO1_31_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO1_31_USB2_OVRCR  AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB2 OVRCR  */
#define PIO1_31_SCK1        AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SCK1        */
#define PIO1_31_AD0_5       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief AD0.5       */
#define PIO1_31_SCL0        AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief I2C0 SCL    */

/** @} */

/**
 * \name PIO1_31 引脚模式定义
 * @{
 */
#define PIO1_31_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO1_31_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO1_31_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO1_31_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO1_31 输入反向控制使能定义
 * @{
 */
#define PIO1_31_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO1_31_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO1_31 模拟/数字模式选择定义
 * @{
 */
#define PIO1_31_ADMODE_ANALOG   AMDR_GPIO_ADMODEENBIT_ANALOG    /**< \brief 模拟模式               */
#define PIO1_31_ADMODE_DIGITAL  AMDR_GPIO_ADMODEENBIT_DIGITAL   /**< \brief 数字模式 (默认)*/
/** @} */

/**
 * \name PIO1_31 控制毛刺滤波器使能定义
 * @{
 */

/** \brief 不进行输入过滤（过滤失能）  */
#define PIO1_31_FILTER_DISABLE   AMDR_GPIO_FILTERENBIT_DISABLE
/** \brief 低于约10ns的噪音被过滤（默认）                 */
#define PIO1_31_FILTER_ENABLE    AMDR_GPIO_FILTERENBIT_ENABLE
/** @} */



/**
 * \name PIO1_31 开漏使能定义
 * @{
 */
#define PIO1_31_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO1_31_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO2_0 引脚功能定义
 * @{
 */
#define PIO2_0_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_0_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO2_0_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_0_PWM1_1       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief PWM1.1 */
#define PIO2_0_TXD1         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief TXD1   */
#define PIO2_0_LCD_PWR      AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD_PWR   */

/** @} */

/**
 * \name PIO2_0 引脚模式定义
 * @{
 */
#define PIO2_0_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_0_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_0_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_0_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO2_0 迟滞模式使能定义
 * @{
 */
#define PIO2_0_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_0_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_0 输入反向控制使能定义
 * @{
 */
#define PIO2_0_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_0_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_0 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_0_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_0_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO2_0 开漏使能定义
 * @{
 */
#define PIO2_0_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_0_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO2_1 引脚功能定义
 * @{
 */
#define PIO2_1_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_1_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO2_1_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_1_PWM1_2       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief PWM1.2 */
#define PIO2_1_RXD1         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief RXD1 */
#define PIO2_1_LCD_LE       AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD_LE   */


/** @} */

/**
 * \name PIO2_1 引脚模式定义
 * @{
 */
#define PIO2_1_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_1_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_1_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_1_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO2_1 迟滞模式使能定义
 * @{
 */
#define PIO2_1_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_1_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_1 输入反向控制使能定义
 * @{
 */
#define PIO2_1_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_1_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_1 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_1_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_1_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO2_1 开漏使能定义
 * @{
 */
#define PIO2_1_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_1_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO2_2 引脚功能定义
 * @{
 */
#define PIO2_2_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_2_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO2_2_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_2_PWM1_3       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief PWM1.3 */
#define PIO2_2_CTS1         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief CTS1 */
#define PIO2_2_MAT2_3       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT2_3  */
#define PIO2_2_TRACEDATA3   AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief TRACEDATA[3]   */
#define PIO2_2_LCD_DCLK     AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD_DCLK  */


/** @} */

/**
 * \name PIO2_2 引脚模式定义
 * @{
 */
#define PIO2_2_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_2_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_2_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_2_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO2_2 迟滞模式使能定义
 * @{
 */
#define PIO2_2_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_2_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_2 输入反向控制使能定义
 * @{
 */
#define PIO2_2_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_2_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_2 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_2_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_2_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO2_2 开漏使能定义
 * @{
 */
#define PIO2_2_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_2_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO2_3 引脚功能定义
 * @{
 */
#define PIO2_3_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_3_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO2_3_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_3_PWM1_4       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief PWM1.4 */
#define PIO2_3_DCD1         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief DCD1   */
#define PIO2_3_MAT2_2       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT2_2  */
#define PIO2_3_TRACEDATA2   AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief TRACEDATA[2]   */
#define PIO2_3_LCD_FP       AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD_FP  */

/** @} */

/**
 * \name PIO2_3 引脚模式定义
 * @{
 */
#define PIO2_3_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_3_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_3_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_3_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO2_3 迟滞模式使能定义
 * @{
 */
#define PIO2_3_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_3_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_3 输入反向控制使能定义
 * @{
 */
#define PIO2_3_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_3_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_3 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_3_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_3_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO2_3 开漏使能定义
 * @{
 */
#define PIO2_3_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_3_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO2_4 引脚功能定义
 * @{
 */
#define PIO2_4_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_4_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO2_4_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_4_PWM1_5       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief PWM1.5 */
#define PIO2_4_DSR1         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief DSR1   */
#define PIO2_4_MAT2_1       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT2_1  */
#define PIO2_4_TRACEDATA1   AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief TRACEDATA[1]   */
#define PIO2_4_LCD_ENAB_M   AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD_ENAB_M  */

/** @} */

/**
 * \name PIO2_4 引脚模式定义
 * @{
 */
#define PIO2_4_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_4_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_4_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_4_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO2_4 迟滞模式使能定义
 * @{
 */
#define PIO2_4_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_4_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_4 输入反向控制使能定义
 * @{
 */
#define PIO2_4_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_4_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_4 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_4_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_4_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO2_4 开漏使能定义
 * @{
 */
#define PIO2_4_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_4_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO2_5 引脚功能定义
 * @{
 */
#define PIO2_5_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_5_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO2_5_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_5_PWM1_6       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief PWM1.6 */
#define PIO2_5_DTR1         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief DTR1   */
#define PIO2_5_MAT2_0       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT2_0  */
#define PIO2_5_TRACEDATA0   AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief TRACEDATA[0]   */
#define PIO2_5_LCD_LP       AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD_LP  */

/** @} */

/**
 * \name PIO2_5 引脚模式定义
 * @{
 */
#define PIO2_5_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_5_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_5_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_5_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO2_5 迟滞模式使能定义
 * @{
 */
#define PIO2_5_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_5_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_5 输入反向控制使能定义
 * @{
 */
#define PIO2_5_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_5_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_5 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_5_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_5_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO2_5 开漏使能定义
 * @{
 */
#define PIO2_5_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_5_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO2_6 引脚功能定义
 * @{
 */
#define PIO2_6_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_6_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO2_6_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_6_PCAP1_0      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief PCAP1.0 */
#define PIO2_6_RI1          AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief RI1     */
#define PIO2_6_CAP2_0       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT2_3  */
#define PIO2_6_OE2          AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief UART2 OE  */
#define PIO2_6_TRACECLK     AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief TRACECLK   */
#define PIO2_6_LCD_VD0      AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[0]  */
#define PIO2_6_LCD_VD4      AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[4]  */

/** @} */

/**
 * \name PIO2_6 引脚模式定义
 * @{
 */
#define PIO2_6_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_6_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_6_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_6_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO2_6 迟滞模式使能定义
 * @{
 */
#define PIO2_6_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_6_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_6 输入反向控制使能定义
 * @{
 */
#define PIO2_6_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_6_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_6 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_6_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_6_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO2_6 开漏使能定义
 * @{
 */
#define PIO2_6_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_6_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO2_7 引脚功能定义
 * @{
 */
#define PIO2_7_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_7_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO2_7_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_7_RD2          AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief RD2      */
#define PIO2_7_RTS1         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief RTS1     */
#define PIO2_7_SPIFI_CS     AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief SPIFI CS   */
#define PIO2_7_LCD_VD1      AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[1]  */
#define PIO2_7_LCD_VD5      AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[5]  */

/** @} */

/**
 * \name PIO2_7 引脚模式定义
 * @{
 */
#define PIO2_7_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_7_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_7_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_7_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO2_7 迟滞模式使能定义
 * @{
 */
#define PIO2_7_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_7_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_7 输入反向控制使能定义
 * @{
 */
#define PIO2_7_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_7_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_7 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_7_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_7_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO2_7 开漏使能定义
 * @{
 */
#define PIO2_7_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_7_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO2_8 引脚功能定义
 * @{
 */
#define PIO2_8_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_8_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO2_8_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_8_TD2          AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief TD2  */
#define PIO2_8_TXD2         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief TXD2 */
#define PIO2_8_CTS1         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief UART1 CTS  */
#define PIO2_8_ENET_MDC     AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief ENET_MDC   */
#define PIO2_8_LCD_VD2      AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[2]  */
#define PIO2_8_LCD_VD6      AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[6]  */
/** @} */

/**
 * \name PIO2_8 引脚模式定义
 * @{
 */
#define PIO2_8_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_8_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_8_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_8_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO2_8 迟滞模式使能定义
 * @{
 */
#define PIO2_8_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_8_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_8 输入反向控制使能定义
 * @{
 */
#define PIO2_8_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_8_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_8 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_8_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_8_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO2_8 开漏使能定义
 * @{
 */
#define PIO2_8_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_8_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO2_9 引脚功能定义
 * @{
 */
#define PIO2_9_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_9_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO2_9_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_9_USB1_CONNECT AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief USB1_CONNECT  */
#define PIO2_9_RXD2         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief RXD2 */
#define PIO2_9_RXD4         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief UART4 RXD  */
#define PIO2_9_ENET_MDIO    AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief ENET_MDIO */
#define PIO2_9_LCD_VD3      AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[3]  */
#define PIO2_9_LCD_VD7      AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[7]  */
/** @} */

/**
 * \name PIO2_9 引脚模式定义
 * @{
 */
#define PIO2_9_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_9_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_9_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_9_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO2_9 迟滞模式使能定义
 * @{
 */
#define PIO2_9_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_9_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_9 输入反向控制使能定义
 * @{
 */
#define PIO2_9_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_9_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_9 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_9_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_9_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO2_9 开漏使能定义
 * @{
 */
#define PIO2_9_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_9_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

