gdgly/AC_Charger/apollo/metal/nxp/ametal_easy_arm_lpc177x_8x/ametal/lpc177x_8x/drivers/include/lpc177x_8x_pin.h
/**
 * \name PIO2_10 引脚功能定义
 * @{
 */
#define PIO2_10_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_10_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO2_10_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_10_EINT0        AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EINT0       */
#define PIO2_10_NMI          AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief NMI         */
/** @} */

/**
 * \name PIO2_10 引脚模式定义
 * @{
 */
#define PIO2_10_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_10_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_10_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_10_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO2_10 迟滞模式使能定义
 * @{
 */
#define PIO2_10_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_10_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_10 输入反向控制使能定义
 * @{
 */
#define PIO2_10_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_10_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_10 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_10_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_10_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO2_10 开漏使能定义
 * @{
 */
#define PIO2_10_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_10_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO2_11 引脚功能定义
 * @{
 */
#define PIO2_11_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_11_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO2_11_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_11_EINT1        AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EINT1       */
#define PIO2_11_SD_DAT1      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief UART4 RXD  */
#define PIO2_11_I2STX_CLK    AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief I2STX_CLK   */
#define PIO2_11_LCD_CLKIN    AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[7]  */

/** @} */

/**
 * \name PIO2_11 引脚模式定义
 * @{
 */
#define PIO2_11_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_11_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_11_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_11_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO2_11 迟滞模式使能定义
 * @{
 */
#define PIO2_11_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_11_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_11 输入反向控制使能定义
 * @{
 */
#define PIO2_11_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_11_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_11 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_11_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_11_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO2_11 开漏使能定义
 * @{
 */
#define PIO2_11_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_11_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO2_12 引脚功能定义
 * @{
 */
#define PIO2_12_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_12_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO2_12_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_12_EINT2        AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EINT2       */
#define PIO2_12_SD_DAT2      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SD DAT[2]  */
#define PIO2_12_I2STX_WS     AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief I2STX_WS    */
#define PIO2_12_LCD_VD4      AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief LCD VD[4]  */
#define PIO2_12_LCD_VD3      AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief LCD VD[3]  */
#define PIO2_12_LCD_VD8      AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[8]  */
#define PIO2_12_LCD_VD18     AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[18] */

/** @} */

/**
 * \name PIO2_12 引脚模式定义
 * @{
 */
#define PIO2_12_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_12_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_12_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_12_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO2_12 迟滞模式使能定义
 * @{
 */
#define PIO2_12_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_12_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_12 输入反向控制使能定义
 * @{
 */
#define PIO2_12_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_12_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_12 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_12_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_12_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO2_12 开漏使能定义
 * @{
 */
#define PIO2_12_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_12_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO2_13 引脚功能定义
 * @{
 */
#define PIO2_13_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_13_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO2_13_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_13_EINT3        AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EINT3       */
#define PIO2_13_SD_DAT3      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief UART4 RXD  */
#define PIO2_13_I2STX_SDA    AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief I2STX_SDA   */
#define PIO2_13_LCD_VD5      AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief LCD VD[5]  */
#define PIO2_13_LCD_VD9      AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[9]  */
#define PIO2_13_LCD_VD19     AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[19] */

/** @} */

/**
 * \name PIO2_13 引脚模式定义
 * @{
 */
#define PIO2_13_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_13_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_13_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_13_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO2_13 迟滞模式使能定义
 * @{
 */
#define PIO2_13_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_13_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_13 输入反向控制使能定义
 * @{
 */
#define PIO2_13_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_13_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_13 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_13_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_13_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */



/**
 * \name PIO2_13 开漏使能定义
 * @{
 */
#define PIO2_13_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_13_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO2_14 引脚功能定义
 * @{
 */
#define PIO2_14_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_14_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO2_14_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_14_EMC_CS2      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC CS2     */
#define PIO2_14_SDA1         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief I2C1_SDA    */
#define PIO2_14_CAP2_0       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief T2 CAP0     */
/** @} */

/**
 * \name PIO2_14 引脚模式定义
 * @{
 */
#define PIO2_14_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_14_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_14_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_14_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO2_14 迟滞模式使能定义
 * @{
 */
#define PIO2_14_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_14_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_14 输入反向控制使能定义
 * @{
 */
#define PIO2_14_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_14_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_14 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_14_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_14_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO2_14 开漏使能定义
 * @{
 */
#define PIO2_14_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_14_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO2_15 引脚功能定义
 * @{
 */
#define PIO2_15_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_15_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO2_15_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_15_EMC_CS3      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC CS3     */
#define PIO2_15_SCL1         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief I2C1_SCL    */
#define PIO2_15_CAP2_1       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief T2 CAP1     */
/** @} */

/**
 * \name PIO2_15 引脚模式定义
 * @{
 */
#define PIO2_15_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_15_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_15_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_15_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO2_15 迟滞模式使能定义
 * @{
 */
#define PIO2_15_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_15_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_15 输入反向控制使能定义
 * @{
 */
#define PIO2_15_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_15_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_15 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_15_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_15_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO2_15 开漏使能定义
 * @{
 */
#define PIO2_15_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_15_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO2_16 引脚功能定义
 * @{
 */
#define PIO2_16_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_16_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO2_16_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_16_EMC_CAS      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC CAS     */
/** @} */

/**
 * \name PIO2_16 引脚模式定义
 * @{
 */
#define PIO2_16_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_16_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_16_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_16_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO2_16 迟滞模式使能定义
 * @{
 */
#define PIO2_16_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_16_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_16 输入反向控制使能定义
 * @{
 */
#define PIO2_16_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_16_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_16 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_16_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_16_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO2_16 开漏使能定义
 * @{
 */
#define PIO2_16_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_16_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO2_17 引脚功能定义
 * @{
 */
#define PIO2_17_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_17_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO2_17_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_17_EMC_RAS      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC RAS     */
/** @} */

/**
 * \name PIO2_17 引脚模式定义
 * @{
 */
#define PIO2_17_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_17_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_17_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_17_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO2_17 迟滞模式使能定义
 * @{
 */
#define PIO2_17_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_17_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_17 输入反向控制使能定义
 * @{
 */
#define PIO2_17_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_17_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_17 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_17_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_17_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO2_17 开漏使能定义
 * @{
 */
#define PIO2_17_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_17_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO2_18 引脚功能定义
 * @{
 */
#define PIO2_18_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_18_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO2_18_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_18_EMC_CLK0     AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC CLK0     */
/** @} */

/**
 * \name PIO2_18 引脚模式定义
 * @{
 */
#define PIO2_18_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_18_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_18_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_18_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO2_18 迟滞模式使能定义
 * @{
 */
#define PIO2_18_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_18_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_18 输入反向控制使能定义
 * @{
 */
#define PIO2_18_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_18_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_18 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_18_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_18_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */


/**
 * \name PIO2_18 开漏使能定义
 * @{
 */
#define PIO2_18_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_18_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO2_19 引脚功能定义
 * @{
 */
#define PIO2_19_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_19_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO2_19_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_19_EMC_CLK1     AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC CLK1    */
/** @} */

/**
 * \name PIO2_19 引脚模式定义
 * @{
 */
#define PIO2_19_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_19_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_19_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_19_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO2_19 迟滞模式使能定义
 * @{
 */
#define PIO2_19_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_19_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_19 输入反向控制使能定义
 * @{
 */
#define PIO2_19_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_19_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_19 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_19_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_19_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO2_19 开漏使能定义
 * @{
 */
#define PIO2_19_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_19_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO2_20 引脚功能定义
 * @{
 */
#define PIO2_20_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_20_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO2_20_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_20_EMC_DYCS0    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC DYCS0   */
/** @} */

/**
 * \name PIO2_20 引脚模式定义
 * @{
 */
#define PIO2_20_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_20_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_20_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_20_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO2_20 迟滞模式使能定义
 * @{
 */
#define PIO2_20_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_20_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_20 输入反向控制使能定义
 * @{
 */
#define PIO2_20_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_20_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_20 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_20_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_20_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO2_20 开漏使能定义
 * @{
 */
#define PIO2_20_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_20_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO2_21 引脚功能定义
 * @{
 */
#define PIO2_21_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_21_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO2_21_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_21_EMC_DYCS1    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC DYCS1   */
/** @} */

/**
 * \name PIO2_21 引脚模式定义
 * @{
 */
#define PIO2_21_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO2_21_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO2_21_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO2_21_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO2_21 迟滞模式使能定义
 * @{
 */
#define PIO2_21_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO2_21_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO2_21 输入反向控制使能定义
 * @{
 */
#define PIO2_21_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO2_21_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO2_21 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO2_21_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO2_21_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO2_21 开漏使能定义
 * @{
 */
#define PIO2_21_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO2_21_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO2_22 引脚功能定义
 * @{
 */
#define PIO2_22_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO2_22_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO2_22_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO2_22_EMC_DYCS2    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC DYCS2   */
#define PIO2_22_SCK0         AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief SSP0 SCK    */
#define PIO2_22_CAP3_0       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief CAP3.0      */
/** @} */

