gdgly/AC_Charger/apollo/metal/nxp/ametal_easy_arm_lpc177x_8x/ametal/lpc177x_8x/drivers/include/lpc177x_8x_pin.h
/**
 * \name PIO3_3 引脚功能定义
 * @{
 */
#define PIO3_3_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_3_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_3_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_3_EMC_D3       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D3       */
/** @} */

/**
 * \name PIO3_3 引脚模式定义
 * @{
 */
#define PIO3_3_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_3_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_3_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_3_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_3 迟滞模式使能定义
 * @{
 */
#define PIO3_3_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_3_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_3 输入反向控制使能定义
 * @{
 */
#define PIO3_3_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_3_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_3 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_3_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_3_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_3 开漏使能定义
 * @{
 */
#define PIO3_3_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_3_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO3_4 引脚功能定义
 * @{
 */
#define PIO3_4_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_4_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_4_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_4_EMC_D4       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D4       */
/** @} */

/**
 * \name PIO3_4 引脚模式定义
 * @{
 */
#define PIO3_4_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_4_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_4_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_4_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_4 迟滞模式使能定义
 * @{
 */
#define PIO3_4_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_4_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_4 输入反向控制使能定义
 * @{
 */
#define PIO3_4_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_4_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_4 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_4_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_4_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_4 开漏使能定义
 * @{
 */
#define PIO3_4_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_4_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_5 引脚功能定义
 * @{
 */
#define PIO3_5_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_5_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_5_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_5_EMC_D5       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D5       */
/** @} */

/**
 * \name PIO3_5 引脚模式定义
 * @{
 */
#define PIO3_5_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_5_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_5_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_5_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_5 迟滞模式使能定义
 * @{
 */
#define PIO3_5_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_5_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_5 输入反向控制使能定义
 * @{
 */
#define PIO3_5_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_5_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_5 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_5_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_5_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_5 开漏使能定义
 * @{
 */
#define PIO3_5_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_5_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/
/**
 * \name PIO3_6 引脚功能定义
 * @{
 */
#define PIO3_6_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_6_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_6_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_6_EMC_D6       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D6       */
/** @} */

/**
 * \name PIO3_6 引脚模式定义
 * @{
 */
#define PIO3_6_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_6_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_6_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_6_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_6 迟滞模式使能定义
 * @{
 */
#define PIO3_6_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_6_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_6 输入反向控制使能定义
 * @{
 */
#define PIO3_6_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_6_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_6 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_6_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_6_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_6 开漏使能定义
 * @{
 */
#define PIO3_6_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_6_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_7 引脚功能定义
 * @{
 */
#define PIO3_7_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_7_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_7_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_7_EMC_D7       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D7       */
/** @} */

/**
 * \name PIO3_7 引脚模式定义
 * @{
 */
#define PIO3_7_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_7_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_7_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_7_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_7 迟滞模式使能定义
 * @{
 */
#define PIO3_7_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_7_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_7 输入反向控制使能定义
 * @{
 */
#define PIO3_7_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_7_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_7 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_7_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_7_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_7 开漏使能定义
 * @{
 */
#define PIO3_7_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_7_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_8 引脚功能定义
 * @{
 */
#define PIO3_8_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_8_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_8_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_8_EMC_D8       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D8       */
/** @} */

/**
 * \name PIO3_8 引脚模式定义
 * @{
 */
#define PIO3_8_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_8_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_8_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_8_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_8 迟滞模式使能定义
 * @{
 */
#define PIO3_8_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_8_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_8 输入反向控制使能定义
 * @{
 */
#define PIO3_8_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_8_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_8 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_8_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_8_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_8 开漏使能定义
 * @{
 */
#define PIO3_8_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_8_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_9 引脚功能定义
 * @{
 */
#define PIO3_9_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_9_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_9_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_9_EMC_D9       AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D9       */
/** @} */

/**
 * \name PIO3_9 引脚模式定义
 * @{
 */
#define PIO3_9_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_9_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_9_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_9_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_9 迟滞模式使能定义
 * @{
 */
#define PIO3_9_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_9_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_9 输入反向控制使能定义
 * @{
 */
#define PIO3_9_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_9_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_9 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_9_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_9_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_9 开漏使能定义
 * @{
 */
#define PIO3_9_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_9_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_10 引脚功能定义
 * @{
 */
#define PIO3_10_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_10_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_10_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_10_EMC_D10      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D10       */
/** @} */

/**
 * \name PIO3_10 引脚模式定义
 * @{
 */
#define PIO3_10_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_10_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_10_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_10_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_10 迟滞模式使能定义
 * @{
 */
#define PIO3_10_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_10_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_10 输入反向控制使能定义
 * @{
 */
#define PIO3_10_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_10_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_10 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_10_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_10_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_10 开漏使能定义
 * @{
 */
#define PIO3_10_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_10_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_11 引脚功能定义
 * @{
 */
#define PIO3_11_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_11_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_11_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_11_EMC_D11      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D11       */
/** @} */

/**
 * \name PIO3_11 引脚模式定义
 * @{
 */
#define PIO3_11_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_11_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_11_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_11_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_11 迟滞模式使能定义
 * @{
 */
#define PIO3_11_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_11_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_11 输入反向控制使能定义
 * @{
 */
#define PIO3_11_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_11_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_11 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_11_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_11_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_11 开漏使能定义
 * @{
 */
#define PIO3_11_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_11_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_12 引脚功能定义
 * @{
 */
#define PIO3_12_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_12_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_12_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_12_EMC_D12      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D12       */
/** @} */

/**
 * \name PIO3_12 引脚模式定义
 * @{
 */
#define PIO3_12_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_12_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_12_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_12_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_12 迟滞模式使能定义
 * @{
 */
#define PIO3_12_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_12_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_12 输入反向控制使能定义
 * @{
 */
#define PIO3_12_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_12_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_12 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_12_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_12_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_12 开漏使能定义
 * @{
 */
#define PIO3_12_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_12_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_13 引脚功能定义
 * @{
 */
#define PIO3_13_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_13_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_13_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_13_EMC_D13      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D13       */
/** @} */

/**
 * \name PIO3_13 引脚模式定义
 * @{
 */
#define PIO3_13_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_13_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_13_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_13_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_13 迟滞模式使能定义
 * @{
 */
#define PIO3_13_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_13_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_13 输入反向控制使能定义
 * @{
 */
#define PIO3_13_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_13_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_13 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_13_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_13_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_13 开漏使能定义
 * @{
 */
#define PIO3_13_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_13_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_14 引脚功能定义
 * @{
 */
#define PIO3_14_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_14_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_14_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_14_EMC_D14      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D14       */
/** @} */

/**
 * \name PIO3_14 引脚模式定义
 * @{
 */
#define PIO3_14_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_14_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_14_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_14_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_14 迟滞模式使能定义
 * @{
 */
#define PIO3_14_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_14_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_14 输入反向控制使能定义
 * @{
 */
#define PIO3_14_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_14_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_14 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_14_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_14_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_14 开漏使能定义
 * @{
 */
#define PIO3_14_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_14_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_15 引脚功能定义
 * @{
 */
#define PIO3_15_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_15_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_15_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_15_EMC_D15      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D15       */
/** @} */

/**
 * \name PIO3_15 引脚模式定义
 * @{
 */
#define PIO3_15_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_15_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_15_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_15_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_15 迟滞模式使能定义
 * @{
 */
#define PIO3_15_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_15_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_15 输入反向控制使能定义
 * @{
 */
#define PIO3_15_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_15_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_15 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_15_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_15_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_15 开漏使能定义
 * @{
 */
#define PIO3_15_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_15_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_16 引脚功能定义
 * @{
 */
#define PIO3_16_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_16_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_16_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_16_EMC_D16      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D16      */
#define PIO3_16_PWM0_1       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM0.1       */
#define PIO3_16_TXD1         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief UART1 TXD    */
/** @} */

