gdgly/AC_Charger/apollo/metal/nxp/ametal_easy_arm_lpc177x_8x/ametal/lpc177x_8x/drivers/include/lpc177x_8x_pin.h
/**
 * \name PIO3_16 引脚模式定义
 * @{
 */
#define PIO3_16_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_16_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_16_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_16_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_16 迟滞模式使能定义
 * @{
 */
#define PIO3_16_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_16_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_16 输入反向控制使能定义
 * @{
 */
#define PIO3_16_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_16_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_16 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_16_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_16_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_16 开漏使能定义
 * @{
 */
#define PIO3_16_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_16_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_17 引脚功能定义
 * @{
 */
#define PIO3_17_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_17_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_17_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_17_EMC_D17      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D17      */
#define PIO3_17_PWM0_2       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM0.2       */
#define PIO3_17_RXD1         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief UART1 RXD    */
/** @} */

/**
 * \name PIO3_17 引脚模式定义
 * @{
 */
#define PIO3_17_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_17_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_17_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_17_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_17 迟滞模式使能定义
 * @{
 */
#define PIO3_17_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_17_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_17 输入反向控制使能定义
 * @{
 */
#define PIO3_17_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_17_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_17 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_17_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_17_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_17 开漏使能定义
 * @{
 */
#define PIO3_17_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_17_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_18 引脚功能定义
 * @{
 */
#define PIO3_18_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_18_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_18_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_18_EMC_D18      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D18      */
#define PIO3_18_PWM0_3       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM0.3       */
#define PIO3_18_CTS1         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief UART1 CTS    */
/** @} */

/**
 * \name PIO3_18 引脚模式定义
 * @{
 */
#define PIO3_18_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_18_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_18_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_18_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_18 迟滞模式使能定义
 * @{
 */
#define PIO3_18_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_18_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_18 输入反向控制使能定义
 * @{
 */
#define PIO3_18_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_18_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_18 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_18_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_18_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_18 开漏使能定义
 * @{
 */
#define PIO3_18_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_18_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
* \name PIO3_19 引脚功能定义
* @{
*/
#define PIO3_19_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_19_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_19_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_19_EMC_D19      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D19      */
#define PIO3_19_PWM0_4       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM0.4       */
#define PIO3_19_DCD1         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief UART1 DCD    */
/** @} */

/**
* \name PIO3_19 引脚模式定义
* @{
*/
#define PIO3_19_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_19_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_19_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_19_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_19 迟滞模式使能定义
 * @{
 */
#define PIO3_19_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_19_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_19 输入反向控制使能定义
 * @{
 */
#define PIO3_19_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_19_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_19 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_19_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_19_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
* \name PIO3_19 开漏使能定义
* @{
*/
#define PIO3_19_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_19_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_20 引脚功能定义
 * @{
 */
#define PIO3_20_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_20_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_20_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_20_EMC_D20      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D20      */
#define PIO3_20_PWM0_5       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM0.5       */
#define PIO3_20_DSR1         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief UART1 DSR    */
/** @} */

/**
 * \name PIO3_20 引脚模式定义
 * @{
 */
#define PIO3_20_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_20_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_20_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_20_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_20 迟滞模式使能定义
 * @{
 */
#define PIO3_20_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_20_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_20 输入反向控制使能定义
 * @{
 */
#define PIO3_20_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_20_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_20 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_20_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_20_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_20 开漏使能定义
 * @{
 */
#define PIO3_20_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_20_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
* \name PIO3_21 引脚功能定义
* @{
*/
#define PIO3_21_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_21_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_21_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_21_EMC_D21      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D21      */
#define PIO3_21_PWM0_6       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM0.6       */
#define PIO3_21_DTR1         AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief UART1 DTR    */
/** @} */

/**
* \name PIO3_21 引脚模式定义
* @{
*/
#define PIO3_21_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_21_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_21_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_21_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_21 迟滞模式使能定义
 * @{
 */
#define PIO3_21_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_21_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_21 输入反向控制使能定义
 * @{
 */
#define PIO3_21_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_21_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_21 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_21_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_21_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
* \name PIO3_21 开漏使能定义
* @{
*/
#define PIO3_21_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_21_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_22 引脚功能定义
 * @{
 */
#define PIO3_22_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_22_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_22_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_22_EMC_D22      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D22      */
#define PIO3_22_PCAP0_0      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM0 CAP0    */
#define PIO3_22_RI1          AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief UART1 RI     */
/** @} */

/**
 * \name PIO3_22 引脚模式定义
 * @{
 */
#define PIO3_22_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_22_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_22_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_22_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_22 迟滞模式使能定义
 * @{
 */
#define PIO3_22_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_22_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_22 输入反向控制使能定义
 * @{
 */
#define PIO3_22_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_22_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_22 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_22_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_22_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_22 开漏使能定义
 * @{
 */
#define PIO3_22_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_22_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */
/******************************************************************************/

/**
 * \name PIO3_23 引脚功能定义
 * @{
 */
#define PIO3_23_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_23_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_23_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_23_EMC_D23      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D23      */
#define PIO3_23_PCAP1_0      AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM1 CAP0    */
#define PIO3_23_CAP0_0       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief T0 CAP0      */
/** @} */

/**
 * \name PIO3_23 引脚模式定义
 * @{
 */
#define PIO3_23_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_23_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_23_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_23_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_23 迟滞模式使能定义
 * @{
 */
#define PIO3_23_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_23_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_23 输入反向控制使能定义
 * @{
 */
#define PIO3_23_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_23_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_23 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_23_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_23_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_23 开漏使能定义
 * @{
 */
#define PIO3_23_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_23_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_24 引脚功能定义
 * @{
 */
#define PIO3_24_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_24_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能    */
#define PIO3_24_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能    */
#define PIO3_24_EMC_D24      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D24      */
#define PIO3_24_PWM1_1       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM1.1    */
#define PIO3_24_CAP0_1       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief T0 CAP1      */
/** @} */

/**
 * \name PIO3_24 引脚模式定义
 * @{
 */
#define PIO3_24_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_24_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_24_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_24_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_24 迟滞模式使能定义
 * @{
 */
#define PIO3_24_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_24_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_24 输入反向控制使能定义
 * @{
 */
#define PIO3_24_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_24_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_24 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_24_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_24_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_24 开漏使能定义
 * @{
 */
#define PIO3_24_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_24_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */


/******************************************************************************/

/**
 * \name PIO3_25 引脚功能定义
 * @{
 */
#define PIO3_25_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_25_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO3_25_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO3_25_EMC_D25      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D25      */
#define PIO3_25_PWM1_2       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM1.2       */
#define PIO3_25_MAT0_0       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT0.0       */
/** @} */

/**
 * \name PIO3_25 引脚模式定义
 * @{
 */
#define PIO3_25_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_25_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_25_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_25_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO3_25 迟滞模式使能定义
 * @{
 */
#define PIO3_25_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_25_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_25 输入反向控制使能定义
 * @{
 */
#define PIO3_25_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_25_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_25 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_25_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_25_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */


/**
 * \name PIO3_25 开漏使能定义
 * @{
 */
#define PIO3_25_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_25_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO3_26 引脚功能定义
 * @{
 */
#define PIO3_26_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_26_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO3_26_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO3_26_EMC_D26      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D25     */
#define PIO3_26_PWM1_3       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM1.3       */
#define PIO3_26_MAT0_1       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT0.1       */
#define PIO3_26_STCLK        AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief STCLK       */
/** @} */

/**
 * \name PIO3_26 引脚模式定义
 * @{
 */
#define PIO3_26_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_26_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_26_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_26_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO3_26 迟滞模式使能定义
 * @{
 */
#define PIO3_26_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_26_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_26 输入反向控制使能定义
 * @{
 */
#define PIO3_26_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_26_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_26 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_26_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_26_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */


/**
 * \name PIO3_26 开漏使能定义
 * @{
 */
#define PIO3_26_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_26_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/


/**
 * \name PIO3_27 引脚功能定义
 * @{
 */
#define PIO3_27_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_27_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO3_27_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO3_27_EMC_D27      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D27     */
#define PIO3_27_PWM1_4       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM1.3       */
#define PIO3_27_CAP1_0       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief CAP0.1       */
/** @} */

/**
 * \name PIO3_27 引脚模式定义
 * @{
 */
#define PIO3_27_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO3_27_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO3_27_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO3_27_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO3_27 迟滞模式使能定义
 * @{
 */
#define PIO3_27_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO3_27_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO3_27 输入反向控制使能定义
 * @{
 */
#define PIO3_27_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO3_27_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO3_27 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO3_27_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO3_27_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO3_27 开漏使能定义
 * @{
 */
#define PIO3_27_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO3_27_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */
/******************************************************************************/

/**
 * \name PIO3_28 引脚功能定义
 * @{
 */
#define PIO3_28_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO3_28_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能 */
#define PIO3_28_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO3_28_EMC_D28      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC D28     */
#define PIO3_28_PWM1_5       AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief PWM1.5       */
#define PIO3_28_CAP1_1       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief CAP0.1       */
/** @} */

