gdgly/AC_Charger/apollo/metal/nxp/ametal_easy_arm_lpc177x_8x/ametal/lpc177x_8x/drivers/include/lpc177x_8x_pin.h
/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO4_22_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO4_22_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO4_22 开漏使能定义
 * @{
 */
#define PIO4_22_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO4_22_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO4_23 引脚功能定义
 * @{
 */
#define PIO4_23_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO4_23_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO4_23_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO4_23_EMC_A23     AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC A23 */
#define PIO4_23_RXD2        AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief UART2 RXD */
#define PIO4_23_MOSI1       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief SSP1 MOSI */
/** @} */

/**
 * \name PIO4_23 引脚模式定义
 * @{
 */
#define PIO4_23_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO4_23_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO4_23_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO4_23_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO4_23 迟滞模式使能定义
 * @{
 */
#define PIO4_23_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO4_23_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO4_23 输入反向控制使能定义
 * @{
 */
#define PIO4_23_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO4_23_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO4_23 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO4_23_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO4_23_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO4_23 开漏使能定义
 * @{
 */
#define PIO4_23_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO4_23_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO4_24 引脚功能定义
 * @{
 */
#define PIO4_24_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO4_24_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO4_24_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO4_24_EMC_OE      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC OE */
/** @} */

/**
 * \name PIO4_24 引脚模式定义
 * @{
 */
#define PIO4_24_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO4_24_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO4_24_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO4_24_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO4_24 迟滞模式使能定义
 * @{
 */
#define PIO4_24_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO4_24_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO4_24 输入反向控制使能定义
 * @{
 */
#define PIO4_24_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO4_24_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO4_24 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO4_24_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO4_24_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO4_24 开漏使能定义
 * @{
 */
#define PIO4_24_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO4_24_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO4_25 引脚功能定义
 * @{
 */
#define PIO4_25_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO4_25_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO4_25_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO4_25_EMC_WE      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC WE */
/** @} */

/**
 * \name PIO4_25 引脚模式定义
 * @{
 */
#define PIO4_25_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO4_25_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO4_25_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO4_25_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO4_25 迟滞模式使能定义
 * @{
 */
#define PIO4_25_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO4_25_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO4_25 输入反向控制使能定义
 * @{
 */
#define PIO4_25_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO4_25_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO4_25 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO4_25_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO4_25_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO4_25 开漏使能定义
 * @{
 */
#define PIO4_25_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO4_25_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */
/******************************************************************************/

/**
 * \name PIO4_26 引脚功能定义
 * @{
 */
#define PIO4_26_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO4_26_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO4_26_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO4_26_EMC_BLS0    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC BLS0 */
/** @} */

/**
 * \name PIO4_26 引脚模式定义
 * @{
 */
#define PIO4_26_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO4_26_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO4_26_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO4_26_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO4_26 迟滞模式使能定义
 * @{
 */
#define PIO4_26_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO4_26_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO4_26 输入反向控制使能定义
 * @{
 */
#define PIO4_26_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO4_26_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO4_26 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO4_26_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO4_26_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO4_26 开漏使能定义
 * @{
 */
#define PIO4_26_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO4_26_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO4_27 引脚功能定义
 * @{
 */
#define PIO4_27_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO4_27_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO4_27_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO4_27_EMC_BLS1    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC BLS1 */
/** @} */

/**
 * \name PIO4_27 引脚模式定义
 * @{
 */
#define PIO4_27_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO4_27_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO4_27_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO4_27_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO4_27 迟滞模式使能定义
 * @{
 */
#define PIO4_27_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO4_27_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO4_27 输入反向控制使能定义
 * @{
 */
#define PIO4_27_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO4_27_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO4_27 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO4_27_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO4_27_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO4_27 开漏使能定义
 * @{
 */
#define PIO4_27_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO4_27_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */


/******************************************************************************/

/**
 * \name PIO4_28 引脚功能定义
 * @{
 */
#define PIO4_28_GPIO        AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO4_28_INPUT       AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO4_28_OUTPUT      AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO4_28_EMC_BLS2    AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC BLS2  */
#define PIO4_28_TXD3        AMDR_GPIO_FUNCBITS_CODE(0x02)    /**< \brief TXD3      */
#define PIO4_28_MAT2_0      AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief MAT2.0    */
#define PIO4_28_LCD_VD6     AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief LCD VD[6] */
#define PIO4_28_LCD_VD10    AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[10]*/
#define PIO4_28_LCD_VD2     AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[2] */
/** @} */

/**
 * \name PIO4_28 引脚模式定义
 * @{
 */
#define PIO4_28_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO4_28_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO4_28_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO4_28_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO4_28 迟滞模式使能定义
 * @{
 */
#define PIO4_28_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO4_28_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO4_28 输入反向控制使能定义
 * @{
 */
#define PIO4_28_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO4_28_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO4_28 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO4_28_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO4_28_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */


/**
 * \name PIO4_28 开漏使能定义
 * @{
 */
#define PIO4_28_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO4_28_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO4_29 引脚功能定义
 * @{
 */
#define PIO4_29_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO4_29_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO4_29_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO4_29_EMC_BLS3    AMDR_GPIO_FUNCBITS_CODE(0x01)     /**< \brief EMC BLS3  */
#define PIO4_29_RXD3        AMDR_GPIO_FUNCBITS_CODE(0x02)     /**< \brief RXD3 */
#define PIO4_29_MAT2_1      AMDR_GPIO_FUNCBITS_CODE(0x03)     /**< \brief MAT2.1 */
#define PIO4_29_SCL2        AMDR_GPIO_FUNCBITS_CODE(0x04)     /**< \brief I2C2 SCL */
#define PIO4_29_LCD_VD7     AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief LCD VD[7] */
#define PIO4_29_LCD_VD11    AMDR_GPIO_FUNCBITS_CODE(0x06)    /**< \brief LCD VD[11]*/
#define PIO4_29_LCD_VD3     AMDR_GPIO_FUNCBITS_CODE(0x07)    /**< \brief LCD VD[3] */
/** @} */

/**
 * \name PIO4_29 引脚模式定义
 * @{
 */
#define PIO4_29_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO4_29_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO4_29_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO4_29_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */


/**
 * \name PIO4_29 迟滞模式使能定义
 * @{
 */
#define PIO4_29_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO4_29_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO4_29 输入反向控制使能定义
 * @{
 */
#define PIO4_29_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO4_29_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO4_29 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO4_29_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO4_29_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO4_29 开漏使能定义
 * @{
 */
#define PIO4_29_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO4_29_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO4_30 引脚功能定义
 * @{
 */
#define PIO4_30_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO4_30_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO4_30_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO4_30_EMC_CS0      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC CS0     */
/** @} */

/**
 * \name PIO4_30 引脚模式定义
 * @{
 */
#define PIO4_30_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO4_30_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO4_30_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO4_30_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO4_30 迟滞模式使能定义
 * @{
 */
#define PIO4_30_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO4_30_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO4_30 输入反向控制使能定义
 * @{
 */
#define PIO4_30_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO4_30_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO4_30 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO4_30_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO4_30_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO4_30 开漏使能定义
 * @{
 */
#define PIO4_30_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO4_30_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO4_31 引脚功能定义
 * @{
 */
#define PIO4_31_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO4_31_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO4_31_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO4_31_EMC_CS1      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC CS1    */
/** @} */

/**
 * \name PIO4_31 引脚模式定义
 * @{
 */
#define PIO4_31_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO4_31_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO4_31_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO4_31_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO4_31 迟滞模式使能定义
 * @{
 */
#define PIO4_31_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO4_31_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO4_31 输入反向控制使能定义
 * @{
 */
#define PIO4_31_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO4_31_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO4_31 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO4_31_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO4_31_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO4_31 开漏使能定义
 * @{
 */
#define PIO4_31_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO4_31_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO5_0 引脚功能定义
 * @{
 */
#define PIO5_0_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO5_0_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO5_0_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO5_0_EMC_A24      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC A24    */
#define PIO5_0_MAT2_2       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief T2 MAT2    */
/** @} */

/**
 * \name PIO5_0 引脚模式定义
 * @{
 */
#define PIO5_0_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO5_0_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO5_0_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO5_0_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO5_0 迟滞模式使能定义
 * @{
 */
#define PIO5_0_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO5_0_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO5_0 输入反向控制使能定义
 * @{
 */
#define PIO5_0_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO5_0_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO5_0 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO5_0_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO5_0_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO5_0 开漏使能定义
 * @{
 */
#define PIO5_0_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO5_0_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO5_1 引脚功能定义
 * @{
 */
#define PIO5_1_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO5_1_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO5_1_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO5_1_EMC_A25      AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief EMC A25    */
#define PIO5_1_MAT2_3       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief T2 MAT2    */
/** @} */

/**
 * \name PIO5_1 引脚模式定义
 * @{
 */
#define PIO5_1_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO5_1_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO5_1_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO5_1_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO5_1 迟滞模式使能定义
 * @{
 */
#define PIO5_1_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO5_1_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO5_1 输入反向控制使能定义
 * @{
 */
#define PIO5_1_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO5_1_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO5_1 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO5_1_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO5_1_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO5_1 开漏使能定义
 * @{
 */
#define PIO5_1_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO5_1_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/******************************************************************************/

/**
 * \name PIO5_2 引脚功能定义
 * @{
 */
#define PIO5_2_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO5_2_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO5_2_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO5_2_MAT3_2       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief T3 MAT2    */
#define PIO5_2_SDA0         AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief I2C0 SDA   */
/** @} */

/**
 * \name PIO5_2 输入反向控制使能定义
 * @{
 */
#define PIO5_2_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO5_2_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO5_2 输入反向控制使能定义
 * @{
 */

/**< \brief I2C 50ns毛刺滤波器及转换速率设置失能     */
#define PIO5_2_HS_DISABLE   AMDR_GPIO_HSENBIT_DISABLE
/**< \brief I2C 50ns毛刺滤波器及转换速率设置使能 (默认)    */
#define PIO5_2_HS_ENABLE    AMDR_GPIO_HSENBIT_ENABLE
/** @} */

/**
 * \name PIO5_2 管脚灌电流能力控制定义
 * @{
 */

/** \brief 输出驱动灌电流为4mA（默认）  */
#define PIO5_2_HIDRIVE_4MA   AMDR_GPIO_HIDRIVEENBIT_4MA
/** \brief 输出驱动灌电流为20mA（默认）                 */
#define PIO5_2_HIDRIVE_20MA    AMDR_GPIO_HIDRIVEENBIT_20MA
/** @} */

/******************************************************************************/

/**
 * \name PIO5_3 引脚功能定义
 * @{
 */
#define PIO5_3_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO5_3_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO5_3_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO5_3_RXD4         AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief UART4 RXD  */
#define PIO5_3_SCL0         AMDR_GPIO_FUNCBITS_CODE(0x05)    /**< \brief I2C0 SCL   */
/** @} */

/**
 * \name PIO5_3 输入反向控制使能定义
 * @{
 */
#define PIO5_3_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO5_3_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO5_3 输入反向控制使能定义
 * @{
 */

/**< \brief I2C 50ns毛刺滤波器及转换速率设置失能     */
#define PIO5_3_HS_DISABLE   AMDR_GPIO_HSENBIT_DISABLE
/**< \brief I2C 50ns毛刺滤波器及转换速率设置使能 (默认)    */
#define PIO5_3_HS_ENABLE    AMDR_GPIO_HSENBIT_ENABLE
/** @} */

/**
 * \name PIO5_3 管脚灌电流能力控制定义
 * @{
 */

/** \brief 输出驱动灌电流为4mA（默认）  */
#define PIO5_3_HIDRIVE_4MA   AMDR_GPIO_HIDRIVEENBIT_4MA
/** \brief 输出驱动灌电流为20mA（默认）                 */
#define PIO5_3_HIDRIVE_20MA    AMDR_GPIO_HIDRIVEENBIT_20MA
/** @} */

/******************************************************************************/

