gdgly/AC_Charger/apollo/metal/nxp/ametal_easy_arm_lpc177x_8x/ametal/lpc177x_8x/drivers/include/lpc177x_8x_pin.h
/**
 * \name PIO5_4 引脚功能定义
 * @{
 */
#define PIO5_4_GPIO         AMDR_GPIO_FUNCBITS_CODE(0x00)    /**< \brief GPIO功能 (默认) */
#define PIO5_4_INPUT        AMDR_GPIO_FUNC_INPUT(0x00)       /**< \brief GPIO输入功能*/
#define PIO5_4_OUTPUT       AMDR_GPIO_FUNC_OUTPUT(0x00)      /**< \brief GPIO输出功能 */
#define PIO5_4_OE0          AMDR_GPIO_FUNCBITS_CODE(0x01)    /**< \brief UART0 OE   */
#define PIO5_4_MAT3_3       AMDR_GPIO_FUNCBITS_CODE(0x03)    /**< \brief T3 MAT3    */
#define PIO5_4_TXD4         AMDR_GPIO_FUNCBITS_CODE(0x04)    /**< \brief UART4 TXD  */
/** @} */

/**
 * \name PIO5_4 引脚模式定义
 * @{
 */
#define PIO5_4_PULLUP      AMDR_GPIO_PULLUP         /**< \brief 内部上拉 (默认)  */
#define PIO5_4_REPEATER    AMDR_GPIO_REPEATER       /**< \brief 中继模式 */
#define PIO5_4_FLOAT       AMDR_GPIO_FLOAT          /**< \brief 高阻(既不上拉也不下拉) */
#define PIO5_4_PULLDOWN    AMDR_GPIO_PULLDOWN       /**< \brief 内部下拉 */
/** @} */

/**
 * \name PIO5_4 迟滞模式使能定义
 * @{
 */
#define PIO5_4_HYS_DISABLE   AMDR_GPIO_HYSENBIT_DISABLE    /**< \brief 迟滞禁能               */
#define PIO5_4_HYS_ENABLE    AMDR_GPIO_HYSENBIT_ENABLE     /**< \brief 迟滞使能 (默认)*/
/** @} */

/**
 * \name PIO5_4 输入反向控制使能定义
 * @{
 */
#define PIO5_4_INVERT_DISABLE   AMDR_GPIO_INVERTENBIT_DISABLE    /**< \brief 输入未反向（默认）     */
#define PIO5_4_INVERT_ENABLE    AMDR_GPIO_INVERTENBIT_ENABLE     /**< \brief 输入反向使能                   */
/** @} */

/**
 * \name PIO5_4 驱动器转换速率控制使能定义
 * @{
 */

/** \brief 高速模式下，输出转换速率控制被禁用   */
#define PIO5_4_SLEW_DISABLE   AMDR_GPIO_SLEWENBIT_DISABLE
/** \brief 标准模式下，输出转换速率控制使能（默认）                  */
#define PIO5_4_SLEW_ENABLE    AMDR_GPIO_SLEWENBIT_ENABLE
/** @} */

/**
 * \name PIO5_4 开漏使能定义
 * @{
 */
#define PIO5_4_OD_DISABLE   AMDR_GPIO_ODENBIT_DISABLE    /**< \brief 开漏禁能 (默认) */
#define PIO5_4_OD_ENABLE    AMDR_GPIO_ODENBIT_ENABLE     /**< \brief 开漏使能 */
/** @} */

/**
 * @} amhw_if_pin
 */

#ifdef __cplusplus
}
#endif

#endif/* __LPC177X_8X_PIN_H */

/* end of file */
